
&НаКлиенте
Процедура ПакетыСборкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	ТекДанные = Элементы.ПакетыСборки.ТекущиеДанные; 
	Если ТекДанные = Неопределено Тогда Возврат КонецЕсли;
	ОткрытьФорму("Обработка.ИнвентаризацияЯчейки.Форма.ФормаИнвентаризацииШтабеля", Новый Структура("Ячейка", ТекДанные.Ячейка), ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьПакетыСборки()
КонецПроцедуры

&НаСервере
Процедура ОбновитьПакетыСборки()
	ПакетыСборки.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НазначенныеПодсборки.Пакет КАК Пакет,
	|	ОстаткиПакетовНаСкладах.Ячейка КАК Ячейка,
	|	ОстаткиПакетовНаСкладах.Объем КАК Объем,
	|	ОстаткиПакетовНаСкладах.Досок КАК Досок,
	|	ОстаткиПакетовНаСкладах.Ряд КАК Ряд,
	|	ОстаткиПакетовНаСкладах.Уровень КАК Уровень,
	|	СвойстваПакетов.Сечение КАК Сечение,
	|	СвойстваПакетов.ДлинаТ КАК ДлинаТ,
	|	СвойстваПакетов.Порода КАК Порода,
	|	СвойстваПакетов.Номер КАК Номер,
	|	СвойстваПакетов.Сорт КАК Сорт,
	|	НазначенныеПодсборки.НомерСпецификации КАК НомерСпецификации,
	|	НазначенныеПодсборки.Покупатель КАК Покупатель,
	|	НазначенныеПодсборки.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.НазначенныеПодсборки КАК НазначенныеПодсборки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОстаткиПакетовНаСкладах КАК ОстаткиПакетовНаСкладах
	|		ПО НазначенныеПодсборки.Пакет = ОстаткиПакетовНаСкладах.НомерПакета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваПакетов КАК СвойстваПакетов
	|		ПО НазначенныеПодсборки.Пакет = СвойстваПакетов.НомерПакета
	|ГДЕ
	|	НазначенныеПодсборки.Место = &Место";
	Запрос.УстановитьПараметр("Место", Место);
	Выборка = Запрос.Выполнить().Выбрать();
	Первый = ИСТИНА;
	Пока Выборка.Следующий() Цикл
		Нов = ПакетыСборки.Добавить();
		Нов.Пакет = Выборка.Пакет;
		Нов.Номер = Выборка.Номер;
		Нов.Описание = ЯчейкиСклада.ОписаниеПакета(Нов.Пакет, Выборка);
		Нов.Адрес = ЯчейкиСклада.АдресПакета(Выборка.Ячейка, Выборка.Ряд, Выборка.Уровень);
		Нов.Ячейка = Выборка.Ячейка;
		Нов.Объем = Выборка.Объем;
		
		Если Первый Тогда
			ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка, "НомерСпецификации,Покупатель,Комментарий"); 
			ЭтаФорма.Заголовок = ""+НомерСпецификации+" ("+Покупатель+")";
			Первый = ЛОЖЬ;
		КонецЕсли;
		
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Место = Параметры.Место;
КонецПроцедуры
