#Область СлужебныйПрограммныйИнтерфейс

// Заголовки запроса.
// 
// Возвращаемое значение:
//  Структура - Заголовки запроса:
// * DeviceName - Строка - 
// * Login - Строка - 
// * Storage - Строка - 
// * Exchange_Node - Строка - 
// * Device - Строка - 
// * version - Строка - 
Функция ЗаголовкиЗапроса() Экспорт
	Заголовки = Новый Структура;
	Заголовки.Вставить("DeviceName", 	ПараметрыСеанса.ИдентификаторУстройства);
	Заголовки.Вставить("Login", 		Константы.ЛогинПУ.Получить());	
	Заголовки.Вставить("Storage",		json.ЗаписатьВСтрокуJSON(ОбщегоНазначенияВызовСервераПовтИсп.МассивСкладовПУ()));
	Заголовки.Вставить("Exchange_Node", ОбщегоНазначенияВызовСервераПовтИсп.УзелПУ()); 
	Заголовки.Вставить("Device", 		ИмяКомпьютера());
	Заголовки.Вставить("version", 		ОбщегоНазначенияВызовСервераПовтИсп.ВерсияКонфигурации());
	
	Возврат Заголовки
		
КонецФункции

// Данные авторизации.
// 
// Возвращаемое значение:
//  Структура - Данные авторизации:
// * Путь - СправочникСсылка.БазыПУ - 
// * Логин - Строка - 
// * Пароль - Строка - 
Функция ДанныеАвторизации() Экспорт
	
	Возврат Новый Структура("Путь,Логин,Пароль",
						Константы.АдресПУ.Получить(),
						Константы.ЛогинПУ.Получить(),
						Константы.ПарольПУ.Получить());
		
КонецФункции

#КонецОбласти

