
Функция ЗаголовкиЗапроса() Экспорт
	Заголовки = Новый Структура;
	Заголовки.Вставить("DeviceName", 	ПараметрыСеанса.ИдентификаторУстройства);
	Заголовки.Вставить("Login", 		Константы.ЛогинПУ.Получить());	
	//Заголовки.Вставить("Storage", 		XMLСтрока(ОбщегоНазначенияВызовСервераПовтИсп.Склад().ИмяПредопределенногоПУ));
	Заголовки.Вставить("Storage",		json.ЗаписатьВСтрокуJSON(ОбщегоНазначенияВызовСервераПовтИсп.МассивСкладовПУ()));
	Заголовки.Вставить("Exchange_Node", ОбщегоНазначенияВызовСервераПовтИсп.УзелПУ()); 
	Заголовки.Вставить("Device", 		ИмяКомпьютера());
	Заголовки.Вставить("version", 		ОбщегоНазначенияВызовСервераПовтИсп.ВерсияКонфигурации());
	
	Возврат Заголовки
		
КонецФункции

Функция ДанныеАвторизации() Экспорт
	
	Возврат Новый Структура("Путь,Логин,Пароль",
						Константы.АдресПУ.Получить(),
						Константы.ЛогинПУ.Получить(),
						Константы.ПарольПУ.Получить());
		
КонецФункции

