
&НаКлиенте
Процедура СоздатьНовую(Команда)
	ТекДанные = Элементы.Список.ТекущиеДанные;
	НачатьСоздатьНовую(ТекДанные)
КонецПроцедуры

&НаСервере
Функция СоздатьКопиюБазы(Оригинал)
	Копия = Справочники.БазыПУ.СоздатьЭлемент(); 
	Копия.ОбменДанными.Загрузка = ИСТИНА;
	Копия.Наименование = Оригинал.Наименование+"_Копия";
	Копия.УстановитьНовыйКод("я");
	Копия.ЭтоКопия = Истина;
	ЗаполнитьЗначенияСвойств(Копия, Оригинал, "Адрес,ЛогинСлужебный,ПарольСлужебный,https,АдресДляPing,ЭтоERP");
	Копия.Записать(); 
	КопияСсылка = Копия.Ссылка;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Склады.Ссылка КАК Ссылка,
	|	Склады.Наименование КАК Наименование,
	|	Склады.ИмяПредопределенногоПУ КАК ИмяПредопределенногоПУ,
	|	Склады.ОтображатьПриАвторизации КАК ОтображатьПриАвторизации,
	|	Склады.ВспомогательныйСклад.Наименование КАК ВспомогательныйСкладНаименование,
	|	Склады.ВспомогательныйСклад.ИмяПредопределенногоПУ КАК ВспомогательныйСкладИмяПредопределенногоПУ,
	|	Склады.ВспомогательныйСклад.ОтображатьПриАвторизации КАК ВспомогательныйСкладОтображатьПриАвторизации
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.Владелец = &Владелец
	|	И Склады.ОтображатьПриАвторизации";
	Запрос.УстановитьПараметр("Владелец", Оригинал);
	Выборка  =Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
		
	Вспом = Справочники.Склады.СоздатьЭлемент();
	Вспом.Владелец = КопияСсылка;
	Вспом.Наименование = Выборка.ВспомогательныйСкладНаименование;
	Вспом.ИмяПредопределенногоПУ = Выборка.ВспомогательныйСкладИмяПредопределенногоПУ;
	Вспом.ОтображатьПриАвторизации = Выборка.ВспомогательныйСкладОтображатьПриАвторизации;
	Вспом.Записать();
	
	ГП = Справочники.Склады.СоздатьЭлемент();
	ГП.Владелец = КопияСсылка;
	ГП.Наименование = Выборка.Наименование;
	ГП.ИмяПредопределенногоПУ = Выборка.ИмяПредопределенногоПУ;
	ГП.ОтображатьПриАвторизации = Выборка.ОтображатьПриАвторизации; 
	ГП.ВспомогательныйСклад = Вспом.Ссылка;
	ГП.Записать();

	Копия.УзелПланаОбмена = МобильноеПриложениеСкладПУ.ПолучитьСоздатьУзелПланаОбменаПУ(Копия);
	
	Копия.Записать();
	
КонецФункции

&НаКлиенте
Асинх Процедура НачатьСоздатьНовую(ТекДанные)
	Если Ждать ПроверитьПароль() Тогда
		СоздатьКопиюБазы(ТекДанные.Ссылка);	
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Асинх Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	Если Ждать ПроверитьПароль() Тогда
		ОткрытьФорму("Справочник.БазыПУ.Форма.ФормаЭлемента", Новый Структура("Ключ,ДоступЕсть", Элементы.Список.ТекущаяСтрока, ИСТИНА));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Асинх Функция ПроверитьПароль()
	Пароль = "";
	Пароль = Ждать ВвестиСтрокуАсинх(Пароль,"Введите пароль доступа", 20, ЛОЖЬ);
	Возврат Пароль = "475000"
КонецФункции
