Процедура НастройкаИнтерфейса() Экспорт
	НачальнаяСтраницаИзКонстанты();
КонецПроцедуры

Процедура НачальнаяСтраницаИзКонстанты() Экспорт
	
	ИмяНачСтраницы = Константы.ИмяНачальнойСтраницы.Получить();
	
	НачальнаяСтраница = Новый НастройкиНачальнойСтраницы;
	
	СоставФорм = НачальнаяСтраница.ПолучитьСоставФорм();
	
	СоставФорм.ЛеваяКолонка.Очистить();
	
	Если ЗначениеЗаполнено(ИмяНачСтраницы) Тогда
		СоставФорм.ЛеваяКолонка.Добавить("ОбщаяФорма."+ИмяНачСтраницы);
	КонецЕсли;
	
	НачальнаяСтраница.УстановитьСоставФорм(СоставФорм);
	
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы", "", НачальнаяСтраница);
	
	
КонецПроцедуры

Процедура НачальнаяСтраницаБГП() Экспорт
	
	
	НачальнаяСтраница = Новый НастройкиНачальнойСтраницы;
	
	СоставФорм = НачальнаяСтраница.ПолучитьСоставФорм();
	
	СоставФорм.ЛеваяКолонка.Очистить();
	
	СоставФорм.ЛеваяКолонка.Добавить("ОбщаяФорма.ФормаРабочегоСтолаБГП");
	
	НачальнаяСтраница.УстановитьСоставФорм(СоставФорм);
	
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы", "", НачальнаяСтраница);
	
	
КонецПроцедуры

Процедура НачальнаяСтраницаПогрузчикБГП() Экспорт
	
	
	НачальнаяСтраница = Новый НастройкиНачальнойСтраницы;
	
	СоставФорм = НачальнаяСтраница.ПолучитьСоставФорм();
	
	СоставФорм.ЛеваяКолонка.Очистить();
	
	СоставФорм.ЛеваяКолонка.Добавить("ОбщаяФорма.ФормаРабочегоСтолаПогрузчик");
	
	НачальнаяСтраница.УстановитьСоставФорм(СоставФорм);
	
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы", "", НачальнаяСтраница);
	
	
КонецПроцедуры