Функция get(Адрес, СоединениеПУ = Неопределено, ДанныеАвторизации = Неопределено, ИмяВыходногоФайла = НЕОПРЕДЕЛЕНО, ДопЗаголовки = НЕОПРЕДЕЛЕНО) Экспорт
	Возврат http.get(Адрес, СоединениеПУ, ДанныеАвторизации, ИмяВыходногоФайла, ДопЗаголовки)
КонецФункции

Функция post(Адрес, ДанныеТела = Неопределено, СоединениеПУ = Неопределено, ДанныеАвторизации = Неопределено, ИмяВыходногоФайла = НЕОПРЕДЕЛЕНО) Экспорт
	Возврат http.post(Адрес, ДанныеТела, СоединениеПУ, ДанныеАвторизации, ИмяВыходногоФайла)
КонецФункции

Функция ЕстьСвязь() Экспорт
	Возврат http.ЕстьСвязь()
КонецФункции

Функция ping(Адрес) Экспорт
	Если Не ЗначениеЗаполнено(Адрес) Тогда Возврат ЛОЖЬ КонецЕсли;
	Возврат http.ping(Адрес)
КонецФункции

Функция РазобратьАдрес(Знач АдресСтрокой) Экспорт
	Возврат http.РазобратьАдрес(АдресСтрокой)
КонецФункции

Функция ДанныеАвторизации() Экспорт
	
	Возврат http_ПовтИсп.ДанныеАвторизации();
		
КонецФункции

Функция ТипКодировки(ЗапросОтвет = Неопределено) Экспорт
	Возврат http.ТипКодировки(ЗапросОтвет)
КонецФункции

Функция Строка_вURL(мСтрока, ТипКодировки) Экспорт
	Возврат КодироватьСтроку(мСтрока, СпособКодированияСтроки.КодировкаURL, ТипКодировки)
КонецФункции

Функция Строка_ИзURL(мСтрока, ТипКодировки) Экспорт
	Возврат РаскодироватьСтроку(мСтрока, СпособКодированияСтроки.КодировкаURL, ТипКодировки)
КонецФункции

Функция ИзвлечьДанныеИзОтветаСервера(Ответ) Экспорт
	Возврат http.ИзвлечьДанныеИзОтветаСервера(Ответ);
КонецФункции

Функция СвойстваСоединения(ДанныеАвторизации) Экспорт
	
	Возврат http.СвойстваСоединения(ДанныеАвторизации);
	
КонецФункции

Функция ИзвлечьДанныеИзСтрокиОтветаСервера(СтрокаОтвета, ТипОтвета) Экспорт
	Возврат http.ИзвлечьДанныеИзСтрокиОтветаСервера(СтрокаОтвета, ТипОтвета);
КонецФункции