
&НаКлиенте
Процедура Очистить(Команда)
	ЗадатьВопросОчистить();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗадатьВопросОчистить()
	Перем ДатаМакс;
	ДатаМакс = ЖДАТЬ ВвестиДатуАсинх(ДатаМакс, "Удалить все события старее даты", ЧастиДаты.ДатаВремя);
	Если ДатаМакс = Неопределено Тогда
		Возврат
	ИначеЕсли Не ЗначениеЗаполнено(ДатаМакс) Тогда
		Возврат;
	Иначе
		УдалитьЗаписиИстории(ДатаМакс);
		Элементы.Список.Обновить();
		ЭтаФорма.ОбновитьОтображениеДанных();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписиИстории(ДатаОграничения)
	НЗ = РегистрыСведений.ИсторияРаботы.СоздатьНаборЗаписей();
	НовыйНЗ = НЗ.ВыгрузитьКолонки();
	НЗ.Прочитать();
	Для Каждого стр из НЗ Цикл
		Если стр.ДатаСобытия>=ДатаОграничения Тогда
			Нов = НовыйНЗ.Добавить();
			ЗаполнитьЗначенияСвойств(нов,стр);
		КонецЕсли;
	КонецЦикла;
	НЗ.Очистить();
	НЗ.Загрузить(НовыйНЗ);
	НЗ.Записать(ИСТИНА);
КонецПроцедуры
