
&НаКлиенте
Процедура ОтборПородаПриИзменении(Элемент)
	УстановитьПользовательскийОтбор("Порода", ОтборПорода)
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПользовательскийОтбор(ИмяОтбора, ЗначениеОтбора)
	УстановитьПользовательскийОтборНаСервере(ИмяОтбора, ЗначениеОтбора)	
КонецПроцедуры

&НаСервере
Процедура УстановитьПользовательскийОтборНаСервере(ИмяПоля, ЗначениеОтбора)
	УстановитьЭлементПользовательскогоОтбораСКД(Отчет.КомпоновщикНастроек, ВидСравненияКомпоновкиДанных.Равно, ИмяПоля, ЗначениеОтбора)	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЭлементПользовательскогоОтбораСКД(КомпоновщикНастроек, ВидСравнения, ИмяПоля, Значение)
	
	ПользовательскийОтбор = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
		КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
		
	ПользовательскийОтбор = КомпоновщикНастроек.ПользовательскиеНастройки;
	
	ЭлементОтбораПользовательский =  ПользовательскийОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементОтбораПользовательский.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор();
	ЭлементОтбораПользовательский.ВидСравнения = ВидСравнения;
	ЭлементОтбораПользовательский.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементОтбораПользовательский.ПравоеЗначение = Значение;
	ЭлементОтбораПользовательский.Использование = Истина;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры
