#Область СлужебныйПрограммныйИнтерфейс

//Асинх Процедура ГеоПриИзмененииДоступностиПровайдеров(ИмяПровайдера, Доступен) Экспорт
//	#Если МобильноеПриложениеКлиент или МобильныйКлиент Тогда
//		ОбработчикИзмененияМестоположения = Новый ОписаниеОповещения("ОбработчикИзмененияМестоположения", ГеопозиционированиеКлиент); 
//		СредстваГеопозиционирования.ОтключитьОбработчикИзмененияМестоположения(ОбработчикИзмененияМестоположения, ИмяПровайдера);
//		Если Доступен Тогда
//			ВыполнитьОбработкуОповещения(ОбработчикИзмененияМестоположения);//ОбработчикИзмененияМестоположения(ИмяПровайдера, Неопределено);
//			СредстваГеопозиционирования.ПодключитьОбработчикИзмененияМестоположения(ОбработчикИзмененияМестоположения, ИмяПровайдера, 5, 5);	
//		КонецЕсли;
//	#КонецЕсли
//КонецПроцедуры

Асинх Процедура ОбработчикИзмененияМестоположения(ИмяПровайдера, ДанныеМестоположения = Неопределено, ДопПар = Неопределено) Экспорт 
	#Если МобильноеПриложениеКлиент или МобильныйКлиент Тогда 
		Если ДанныеМестоположения = Неопределено Тогда 
			Если СредстваГеопозиционирования.ОбновитьМестоположение(ИмяПровайдера, 60) Тогда
				ДанныеМестоположения = СредстваГеопозиционирования.ПолучитьПоследнееМестоположение(ИмяПровайдера);
			КонецЕсли;
		КонецЕсли; 
		Если ДанныеМестоположения = Неопределено Тогда
			Возврат 
		КонецЕсли;
		ОбновитьДанныеГеоПозиции(ДанныеМестоположения);
		Если Не ОбщегоНазначенияВызовСервераПовтИсп.ОтключитьЗаписьТрека() Тогда
			ГеопозиционированиеВызовСервера.ЗаписатьДанныеГеоПозицииВТрек(ДанныеГеоПозиции);
		КонецЕсли;
		Оповестить("ИзменениеМестоположения", ДанныеГеоПозиции);
	#КонецЕсли
КонецПроцедуры

Процедура ДанныеГеоПозиции_Инициализация() Экспорт
	ДанныеГеоПозиции = Новый Структура("ТекущееМестоположение,Скорость,Дата", "-", 0, ТекущаяДата());
КонецПроцедуры

//Функция ПолучитьТекущееМестоположение(Знач Принудительно = ЛОЖЬ) Экспорт 
//	#Если МобильноеПриложениеКлиент или МобильныйКлиент Тогда
//		Если СредстваГеопозиционирования.ИспользованиеДанныхГеопозиционированияВключено() и Не ЛучшийПровайдерГЕО = Неопределено Тогда
//			ПолучитьТекущееПоложение = ЛОЖЬ;
//			Если Принудительно Тогда
//				ОбновитьТекущееПоложение = ИСТИНА;
//			ИначеЕсли ДанныеГеоПозиции = Неопределено Тогда
//				ДанныеГеоПозиции_Инициализация();
//				ОбновитьТекущееПоложение = ИСТИНА;
//			Иначе
//				ОбновитьТекущееПоложение = ТекущаяДата() - СмещениеСтандартногоВремени - ДанныеГеоПозиции.Дата > 30
//			КонецЕсли;
//			
//			Если ОбновитьТекущееПоложение Тогда 
//				Попытка 
//					Если СредстваГеопозиционирования.ОбновитьМестоположение(ЛучшийПровайдерГЕО.Имя, 60) Тогда
//						ДанныеМестоположения = СредстваГеопозиционирования.ПолучитьПоследнееМестоположение(ЛучшийПровайдерГЕО.Имя);
//						
//						ОбновитьДанныеГеоПозиции(ДанныеМестоположения);
//						
//					КонецЕсли;
//					
//				Исключение
//					а=1;
//				КонецПопытки
//			КонецЕсли;
//		Иначе
//			ДанныеГеоПозиции_Инициализация();	
//		КонецЕсли;
//	#Иначе
//		ДанныеГеоПозиции_Инициализация();		
//	#КонецЕсли 
//	Возврат ДанныеГеоПозиции
//КонецФункции

Процедура ПодключитьОбработчикИзмененияДоступностиПровайдеров() Экспорт
#Если МобильноеПриложениеКлиент Или МобильныйКлиент Тогда
	СредстваГеопозиционирования.ПодключитьОбработчикИзмененияДоступностиПровайдеров(
		"ОбработчикИзмененияДоступностиПровайдеров");
#КонецЕсли
КонецПроцедуры

Процедура ОбработчикИзмененияДоступностиПровайдеров(ИмяПровайдера, Доступен, ДополнительныйПараметр) Экспорт
	Если НЕ ЛучшийПровайдерГЕО = Неопределено Тогда
		Если Доступен = ЛОЖЬ и ЛучшийПровайдерГЕО.Имя = ИмяПровайдера Тогда
			ЛучшийПровайдерГЕО = Неопределено;
			#Если МобильноеПриложениеКлиент или МобильныйКлиент Тогда
			СредстваГеопозиционирования.ОтключитьОбработчикИзмененияМестоположения("ОбработчикИзмененияМестоположения", ИмяПровайдера);
			#КонецЕсли
		КонецЕсли;
	КонецЕсли;
	
	Если Доступен = ЛОЖЬ и ЛучшийПровайдерГЕО <> Неопределено и ЛучшийПровайдерГЕО.Имя = ИмяПровайдера Тогда
		ЛучшийПровайдерГЕО = Неопределено;
	КонецЕсли;
	ОпределитьЛучшегоПровайдераГЕО();
КонецПроцедуры

Асинх Процедура ОпределитьЛучшегоПровайдераГЕО() Экспорт
	#Если МобильноеПриложениеКлиент или МобильныйКлиент Тогда
		Если НЕ СредстваГеопозиционирования.ИспользованиеДанныхГеопозиционированияВключено() Тогда
			ЛучшийПровайдерГЕО = Неопределено;
			Возврат
		КонецЕсли;
		
		ВсеПровайдеры = СредстваГеопозиционирования.ПолучитьПровайдеров(ИСТИНА); 
		Если ВсеПровайдеры = Неопределено Тогда
			 Возврат 
		КонецЕсли;
		СамыйТочныйПровайдер = Неопределено;
		Для Каждого Провайдер из ВсеПровайдеры Цикл
			Если СамыйТочныйПровайдер = Неопределено Тогда
				СамыйТочныйПровайдер = Провайдер;
				Продолжить;	
			КонецЕсли;
			Если СамыйТочныйПровайдер.Точность > Провайдер.Точность Тогда
				СамыйТочныйПровайдер = Провайдер;
			КонецЕсли;
		КонецЦикла;
		
		Если ЛучшийПровайдерГЕО = СамыйТочныйПровайдер  или СамыйТочныйПровайдер = Неопределено Тогда
			Возврат
		Иначе
			ЛучшийПровайдерГЕО = СамыйТочныйПровайдер;
		КонецЕсли;
		
		СредстваГеопозиционирования.ОтключитьОбработчикИзмененияМестоположения("ОбработчикИзмененияМестоположения", ЛучшийПровайдерГЕО.Имя);
		
		ЛучшийПровайдерГЕО = СамыйТочныйПровайдер;
		СредстваГеопозиционирования.ПодключитьОбработчикИзмененияМестоположения("ОбработчикИзмененияМестоположения", ЛучшийПровайдерГЕО.Имя, 5, 10);
		ОбработчикИзмененияМестоположения(ЛучшийПровайдерГЕО.Имя);
		
	#КонецЕсли 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ОбновитьДанныеГеоПозиции(ДанныеМестоположения) 
	Если ДанныеГеоПозиции = Неопределено Тогда
		ДанныеГеоПозиции_Инициализация()
	КонецЕсли;
	
	ДанныеГеоПозиции.ТекущееМестоположение = СтрШаблон("%1, %2", ДанныеМестоположения.Координаты.Широта, ДанныеМестоположения.Координаты.Долгота);
	ДанныеГеоПозиции.Скорость = ДанныеМестоположения.Скорость;
	ДанныеГеоПозиции.Дата = ДанныеМестоположения.Дата;
КонецПроцедуры
#КонецОбласти