Асинх Процедура ГеоПриИзмененииДоступностиПровайдеров(ИмяПровайдера, Доступен) Экспорт
	#Если МобильноеПриложениеКлиент или МобильныйКлиент Тогда
		ОбработчикИзмененияМестоположения = Новый ОписаниеОповещения("ОбработчикИзмененияМестоположения", ГеопозиционированиеКлиент); 
		СредстваГеопозиционирования.ОтключитьОбработчикИзмененияМестоположения(ОбработчикИзмененияМестоположения, ИмяПровайдера);
		Если Доступен Тогда
			ОбработчикИзмененияМестоположения(ИмяПровайдера, Неопределено);
			СредстваГеопозиционирования.ПодключитьОбработчикИзмененияМестоположения(ОбработчикИзмененияМестоположения, ИмяПровайдера, 5, 5);	
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

Асинх Процедура ОбработчикИзмененияМестоположения(ИмяПровайдера, ДанныеМестоположения = Неопределено, ДопПар = Неопределено) Экспорт 
	#Если МобильноеПриложениеКлиент или МобильныйКлиент Тогда 
		Если ДанныеМестоположения = Неопределено Тогда 
			Если СредстваГеопозиционирования.ОбновитьМестоположение(ИмяПровайдера, 60) Тогда
				ДанныеМестоположения = СредстваГеопозиционирования.ПолучитьПоследнееМестоположение(ИмяПровайдера);
			КонецЕсли;
		КонецЕсли; 
		Если ДанныеМестоположения = Неопределено Тогда
			Возврат 
		КонецЕсли;
		ОбновитьДанныеГеоПозиции(ДанныеМестоположения);
		ГеопозиционированиеВызовСервера.ЗаписатьДанныеГеоПозицииВТрек(ДанныеГеоПозиции);
		Оповестить("ИзменениеМестоположения", ДанныеГеоПозиции);
	#КонецЕсли
КонецПроцедуры

Процедура ДанныеГеоПозиции_Инициализация() Экспорт
	ДанныеГеоПозиции = Новый Структура("ТекущееМестоположение,Скорость,Дата", "-", 0, ТекущаяДата());
КонецПроцедуры

Процедура ОбновитьДанныеГеоПозиции(ДанныеМестоположения) Экспорт 
	Если ДанныеГеоПозиции = Неопределено Тогда
		ДанныеГеоПозиции_Инициализация()
	КонецЕсли;
	
	ДанныеГеоПозиции.ТекущееМестоположение = СтрШаблон("%1, %2", ДанныеМестоположения.Координаты.Широта, ДанныеМестоположения.Координаты.Долгота);
	ДанныеГеоПозиции.Скорость = ДанныеМестоположения.Скорость;
	ДанныеГеоПозиции.Дата = ДанныеМестоположения.Дата;
КонецПроцедуры

Функция ПолучитьТекущееМестоположение(Знач Принудительно = ЛОЖЬ) Экспорт 
	#Если МобильноеПриложениеКлиент или МобильныйКлиент Тогда
		Если СредстваГеопозиционирования.ИспользованиеДанныхГеопозиционированияВключено() и Не ЛучшийПровайдерГЕО = Неопределено Тогда
			ПолучитьТекущееПоложение = ЛОЖЬ;
			Если Принудительно Тогда
				ОбновитьТекущееПоложение = ИСТИНА;
			ИначеЕсли ДанныеГеоПозиции = Неопределено Тогда
				ДанныеГеоПозиции_Инициализация();
				ОбновитьТекущееПоложение = ИСТИНА;
			Иначе
				ОбновитьТекущееПоложение = ТекущаяДата() - СмещениеСтандартногоВремени - ДанныеГеоПозиции.Дата > 30
			КонецЕсли;
			
			Если ОбновитьТекущееПоложение Тогда 
				Попытка 
					Если СредстваГеопозиционирования.ОбновитьМестоположение(ЛучшийПровайдерГЕО.Имя, 60) Тогда
						ДанныеМестоположения = СредстваГеопозиционирования.ПолучитьПоследнееМестоположение(ЛучшийПровайдерГЕО.Имя);
						
						ОбновитьДанныеГеоПозиции(ДанныеМестоположения);
						
					КонецЕсли;
					
				Исключение
					а=1;
				КонецПопытки
			КонецЕсли;
		Иначе
			ДанныеГеоПозиции_Инициализация();	
		КонецЕсли;
	#Иначе
		ДанныеГеоПозиции_Инициализация();		
	#КонецЕсли 
	Возврат ДанныеГеоПозиции
КонецФункции


Процедура ПодключитьОбработчикИзмененияДоступностиПровайдеров() Экспорт
	#Если МобильноеПриложениеКлиент или МобильныйКлиент Тогда
	СредстваГеопозиционирования.ПодключитьОбработчикИзмененияДоступностиПровайдеров("ОбработчикИзмененияДоступностиПровайдеров");	
	#КонецЕсли 
КонецПроцедуры

Процедура ОбработчикИзмененияДоступностиПровайдеров(ИмяПровайдера, Доступен, ДополнительныйПараметр) Экспорт
	ОпределитьЛучшегоПровайдераГЕО();
КонецПроцедуры

Асинх Процедура ОпределитьЛучшегоПровайдераГЕО() Экспорт
	#Если МобильноеПриложениеКлиент или МобильныйКлиент Тогда
		Если НЕ СредстваГеопозиционирования.ИспользованиеДанныхГеопозиционированияВключено() Тогда
			ЛучшийПровайдерГЕО = Неопределено;
			Возврат
		КонецЕсли;
		
		ЛучшийПровайдерГЕО = СредстваГеопозиционирования.ПолучитьСамогоТочногоПровайдера(ИСТИНА);
		Если ЛучшийПровайдерГЕО = Неопределено Тогда
			ВсеПровайдеры = СредстваГеопозиционирования.ПолучитьПровайдеров(ИСТИНА); 
			Если ВсеПровайдеры = Неопределено Тогда Возврат КонецЕсли;
			Для Каждого Провайдер из ВсеПровайдеры Цикл
				Если ЛучшийПровайдерГЕО = Неопределено Тогда
					ЛучшийПровайдерГЕО = Провайдер;
					СредстваГеопозиционирования.ПодключитьОбработчикИзмененияМестоположения("ОбработчикИзмененияМестоположения", ЛучшийПровайдерГЕО.Имя, 10, 10);
					ОбработчикИзмененияМестоположения(ЛучшийПровайдерГЕО.Имя);
				ИначеЕсли ЛучшийПровайдерГЕО.Точность > Провайдер.Точность Тогда
					СредстваГеопозиционирования.ОтключитьОбработчикИзмененияМестоположения("ОбработчикИзмененияМестоположения", ЛучшийПровайдерГЕО.Имя);
					ЛучшийПровайдерГЕО = Провайдер;
					СредстваГеопозиционирования.ПодключитьОбработчикИзмененияМестоположения("ОбработчикИзмененияМестоположения", ЛучшийПровайдерГЕО.Имя, 10, 10);
					ОбработчикИзмененияМестоположения(ЛучшийПровайдерГЕО.Имя);
				КонецЕсли;
			КонецЦикла; 
		Иначе
			СредстваГеопозиционирования.ОтключитьОбработчикИзмененияМестоположения("ОбработчикИзмененияМестоположения", ЛучшийПровайдерГЕО.Имя);
			СредстваГеопозиционирования.ПодключитьОбработчикИзмененияМестоположения("ОбработчикИзмененияМестоположения", ЛучшийПровайдерГЕО.Имя, 10, 10);
			ОбработчикИзмененияМестоположения(ЛучшийПровайдерГЕО.Имя);
		КонецЕсли; 
		
	#КонецЕсли 
КонецПроцедуры
