
Процедура ПриЗаписи(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		ОбменДанными.Получатели.АвтоЗаполнение = ЛОЖЬ;
		ОбменДанными.Получатели.Очистить();
		Возврат
	КонецЕсли;
	
	УзлыЗаписи = Новый Соответствие;
	ЧислоЗаписей = 0;
	Для Каждого м из ЭтотОбъект Цикл
		ЧислоЗаписей = ЧислоЗаписей + 1;
	КонецЦикла; 
	ОбменДанными.Получатели.АвтоЗаполнение = ЛОЖЬ;
	
	ОбменДанными.Получатели.Очистить();
	Если ЧислоЗаписей = 0 Тогда Возврат КонецЕсли; // Это удаление
	
	ОбменДанными.Получатели.Добавить(ОбщегоНазначенияВызовСервераПовтИсп.БазаПУ().УзелПланаОбмена);
КонецПроцедуры
