Функция СтильВремени() Экспорт
	Стиль = ОписаниеСтиляДень();
	Если ПараметрыСеанса.ВидИнтерфейсаНочь Тогда
		Стиль = ОписаниеСтиляНочь();
	КонецЕсли;
	
	Возврат Стиль	
КонецФункции

Функция СолнцеЗашло() Экспорт
	Возврат Час(ТекущаяДата())<6 или Час(ТекущаяДата())>19
КонецФункции

Процедура ДобавитьСтильВОписаниЕСтиля(Описание, Знач ИмяСтиля, ЦветФона, ЦветТекста, ЦветТекстаЗаголовка)
	Если ЗначениеЗаполнено(ИмяСтиля) Тогда
		ИмяСтиля = ИмяСтиля+"_";	
	КонецЕсли;
	
	Описание.Вставить(ИмяСтиля+"ЦветФона",			   ЦветФона);
	Описание.Вставить(ИмяСтиля+"ЦветТекста",		   ЦветТекста);
	Описание.Вставить(ИмяСтиля+"ЦветТекстаЗаголовка", ЦветТекстаЗаголовка);
	
КонецПроцедуры

Функция ОписаниеСтиляДень() Экспорт
	
	ц_F5F5F5 = Новый Цвет(245, 245, 245);
	ц_6A82BF = Новый Цвет(106, 130, 191);
	ц_60858f = Новый Цвет(96, 133, 143);
	ц_00998E = Новый Цвет(0, 153, 142);
	ц_18A659 = Новый Цвет(24, 166, 89);
	ц_000000 = Новый Цвет(00, 00, 00);
	
	Описание = Новый Структура;
	ДобавитьСтильВОписаниЕСтиля(Описание, "", ц_F5F5F5, ц_000000, ц_000000);
	ДобавитьСтильВОписаниЕСтиля(Описание, "Стиль1", ц_F5F5F5, ц_60858f, ц_60858f);
	ДобавитьСтильВОписаниЕСтиля(Описание, "Стиль2", ц_F5F5F5, ц_6A82BF, ц_6A82BF);
	ДобавитьСтильВОписаниЕСтиля(Описание, "Стиль3", ц_F5F5F5, ц_00998E, ц_00998E);
	ДобавитьСтильВОписаниЕСтиля(Описание, "Стиль4", ц_60858f, ц_F5F5F5, ц_F5F5F5);
	ДобавитьСтильВОписаниЕСтиля(Описание, "Стиль5", ц_00998E, ц_F5F5F5, ц_F5F5F5);
	
	Возврат Описание
КонецФункции

Функция ОписаниеСтиляНочь() Экспорт
	
	ц_F5F5F5 = Новый Цвет(245, 245, 245);
	ц_6A82BF = Новый Цвет(106, 130, 191);
	ц_60858f = Новый Цвет(96, 133, 143);
	ц_00998E = Новый Цвет(0, 153, 142);
	ц_18A659 = Новый Цвет(24, 166, 89);
	ц_000000 = Новый Цвет(00, 00, 00);
	
	Описание = Новый Структура;
	ДобавитьСтильВОписаниЕСтиля(Описание, "",		ц_60858f, ц_F5F5F5, ц_F5F5F5);
	ДобавитьСтильВОписаниЕСтиля(Описание, "Стиль1", ц_60858f, ц_F5F5F5, ц_F5F5F5);
	ДобавитьСтильВОписаниЕСтиля(Описание, "Стиль2", ц_6A82BF, ц_F5F5F5, ц_F5F5F5);
	ДобавитьСтильВОписаниЕСтиля(Описание, "Стиль3", ц_00998E, ц_F5F5F5, ц_F5F5F5);
	ДобавитьСтильВОписаниЕСтиля(Описание, "Стиль4", ц_F5F5F5, ц_60858f, ц_60858f);
	ДобавитьСтильВОписаниЕСтиля(Описание, "Стиль5", ц_F5F5F5, ц_00998E, ц_00998E);
	
	Возврат Описание
КонецФункции

Процедура НастроитьТемуИнтерфейса(Форма) Экспорт
	Для Каждого эл из Форма.ПодчиненныеЭлементы Цикл
		НастроитьСтильЭлемента(эл);
	КонецЦикла;
КонецПроцедуры

Функция МассивСтилейЭлемента()
	Массив = Новый Массив;
	Массив.Добавить("ЦветФона");
	Массив.Добавить("ЦветТекста");
	Массив.Добавить("ЦветТекстаЗаголовка");
	Возврат Массив;
КонецФункции

Функция МассивСтилейГруппыКолонок()
	Массив = Новый Массив;
	Массив.Добавить("ЦветФонаЗаголовка");
	Массив.Добавить("ЦветТекстаЗаголовка");
	Возврат Массив;
КонецФункции

Функция МассивСтилейГрупп()
	Массив = Новый Массив;
	Массив.Добавить("ЦветФона");
	Массив.Добавить("ЦветТекстаЗаголовка");
	Возврат Массив;
КонецФункции

Функция МассивСтилейДекорация()
	Массив = Новый Массив;
	Массив.Добавить("ЦветФона");
	Массив.Добавить("ЦветТекста");
	Возврат Массив;
КонецФункции

Процедура УстановитьЦветЭлемента(Эл, ОбластьЦвета, Цвет)
	Перем МассивДоступныхОбластей;
	
	Тип = ТипЗнч(Эл);
	
	Если Тип = Тип("ГруппаФормы") Тогда
		Если Эл.Вид = ВидГруппыФормы.ГруппаКолонок Тогда
			МассивДоступныхОбластей = МассивСтилейГруппыКолонок();
		ИначеЕсли Эл.Вид = ВидГруппыФормы.Страницы или Эл.Вид = ВидГруппыФормы.Страница Тогда
			МассивДоступныхОбластей = Новый Массив;
		Иначе
			МассивДоступныхОбластей = МассивСтилейГрупп();
		КонецЕсли;
	ИначеЕсли Тип = Тип("ТаблицаФормы") Тогда
		МассивДоступныхОбластей = МассивСтилейГрупп();	
	ИначеЕсли Тип = Тип("ДекорацияФормы") Тогда
		МассивДоступныхОбластей = МассивСтилейДекорация();
	ИначеЕсли Тип = Тип("КнопкаФормы") Тогда
		МассивДоступныхОбластей = МассивСтилейДекорация();
	ИначеЕсли Тип = Тип("ПолеФормы") Тогда
		МассивДоступныхОбластей = МассивСтилейЭлемента();
		Если Эл.Вид = ВидПоляФормы.ПолеКартинки Тогда
			МассивДоступныхОбластей.Удалить(МассивДоступныхОбластей.Найти("ЦветФона"));
		КонецЕсли;
	Иначе
		а=1;
	КонецЕсли;
	
	//МассивДоступныхОбластей = ДоступныеОбластиСтиляТиповЭлементов().Получить(Тип);
	Если МассивДоступныхОбластей = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если МассивДоступныхОбластей.Найти(ОбластьЦвета) = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Попытка
		Эл[ОбластьЦвета] = Цвет;
	Исключение
		а=1;
	КонецПопытки
	
КонецПроцедуры

Процедура НастроитьСтильЭлемента(Эл, Стиль = Неопределено) Экспорт
	Если Стиль = Неопределено Тогда
		Стиль = СтилиФорм.СтильВремени();
	КонецЕсли;
	
	ИмяСтиля = "";
	Если СтрНайти(эл.Имя,"_Стиль")>0 Тогда
		ИмяСтиля = Сред(эл.Имя,СтрНайти(эл.Имя,"_")+1);	
	КонецЕсли;
	
	Если ИмяСтиля = "" Тогда
		УстановитьЦветЭлемента(Эл, "ЦветФона",				 Стиль.ЦветФона);
		УстановитьЦветЭлемента(Эл, "ЦветТекста",			 Стиль.ЦветТекста);
		УстановитьЦветЭлемента(Эл, "ЦветТекстаЗаголовка",	 Стиль.ЦветТекстаЗаголовка);
	Иначе
		УстановитьЦветЭлемента(Эл, "ЦветФона",				 Стиль[ИмяСтиля+"_ЦветФона"]);
		УстановитьЦветЭлемента(Эл, "ЦветТекста",			 Стиль[ИмяСтиля+"_ЦветТекста"]);
		УстановитьЦветЭлемента(Эл, "ЦветТекстаЗаголовка",	 Стиль[ИмяСтиля+"_ЦветТекстаЗаголовка"]);
	КонецЕсли;
	
	Если ТипЗнч(Эл) = Тип("ГруппаФормы")
		Или ТипЗнч(Эл) = Тип("ТаблицаФормы") Тогда
		Для Каждого ПодчЭл из Эл.ПодчиненныеЭлементы Цикл
			НастроитьСтильЭлемента(ПодчЭл, Стиль)	
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры
