Процедура Отложить(ТекстОшибки) Экспорт
	МЗ = РегистрыСведений.ОшибкиКОтправке.СоздатьМенеджерЗаписи();
	МЗ.ДатаВремя = ТекущаяДатаСеанса();
	МЗ.Ошибка = ТекстОшибки;
	МЗ.Записать(ИСТИНА);
КонецПроцедуры  

Процедура ОтправитьПервуюОтложенную(ИдентификаторПользователяОповещениеОшибка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОшибкиКОтправке.ДатаВремя КАК ДатаВремя,
	|	ОшибкиКОтправке.Ошибка КАК Ошибка
	|ИЗ
	|	РегистрСведений.ОшибкиКОтправке КАК ОшибкиКОтправке
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВремя";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Отправлено = telegram.ОтправитьСообщениеВТелегу(ИдентификаторПользователяОповещениеОшибка, Выборка.Ошибка, ЛОЖЬ);
		Если Отправлено Тогда
			МЗ = РегистрыСведений.ОшибкиКОтправке.СоздатьМенеджерЗаписи();
			МЗ.ДатаВремя = ТекущаяДатаСеанса();
			МЗ.Удалить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

