
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если МобильноеПриложениеКлиент или МобильныйКлиент  Тогда
	#Иначе
		//Элементы.ГруппаСтраниц.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	#КонецЕсли 
	
	ПриОткрытииАсинх();
	ПриИзмененииПараметровЭкрана();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПриОткрытииАсинх()
	ЕстьСвязь = Ждать http_Клиент.ЕстьСвязь();
	Если Не ЕстьСвязь Тогда Возврат КонецЕсли;
	ТаблицаПартийОбработкаЗапросаОбновления()
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "Новая партия сортировки" и АвторизацияВыполнена Тогда
		
		ТаблицаПартийОбработкаЗапросаОбновления()
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	ОбщегоНазначенияКлиент.ЗаполнитьСвойстваФормыПриИзмененииПараметровЭкрана(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Область ПодключаемыеПроцедурыИФункции


#КонецОбласти

&НаКлиенте
Процедура ТаблицаПартийОбработкаЗапросаОбновления()
	Если ЕстьСвязь Тогда
		ОбновитьСписокПартийСортировкиНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьСписокПартийСортировки(ВыбСтрока, ДопПар) Экспорт
	ТаблицаПартийОбработкаЗапросаОбновления()	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокПартийСортировкиНаСервере()
	ДанныеПУ = ПартииСортировки.ПолучитьТекущиеПартии();
	ТаблицаПартий.Очистить(); 
	Если ДанныеПУ = Неопределено Тогда Возврат КонецЕсли;
	Для Каждого стр из ДанныеПУ Цикл
		Нов = ТаблицаПартий.Добавить();
		ЗаполнитьЗначенияСвойств(Нов,стр);
		Нов.ВидПродукции = Справочники.ВидыПродукции.ПолучитьСсылку(стр.ВидПродукции);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПартийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьФормуРедактированияСтрокиРазмещения(ВыбраннаяСтрока);
	СтандартнаяОбработка = ЛОЖЬ;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияСтрокиРазмещения(ВыбраннаяСтрока)
	//Открыть настройку партии
	ТекДанные = Элементы.ТаблицаПартий.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда Возврат КонецЕсли;

	Пар = Новый Структура("Номер,Дата,id,Сечение,ВидПродукции,Порода");
	ЗаполнитьЗначенияСвойств(Пар, ТекДанные);
	ДействиеПриЗакрытии = Новый ОписаниеОповещения("Подключаемый_ОбновитьСписокПартийСортировки", ЭтотОбъект, ВыбраннаяСтрока);
	ОткрытьФорму("ОбщаяФорма.ФормаПартииСортировки",Пар, ЭтаФорма, ТекДанные.id,,,ДействиеПриЗакрытии);

КонецПроцедуры 


