
Функция ВыполнитьФоново(ИмяМетода, СтруктураПараметровДЗ, Наименование, ОповещениеПослеОбновления = Неопределено, ОткрыватьФормуДлительноОперации = ЛОЖЬ) Экспорт
	МассивПараметровМетода  = Новый Массив;
	Для Каждого м из СтруктураПараметровДЗ Цикл
		МассивПараметровМетода.Добавить(м.Значение);
	КонецЦикла;
	ФЗ = ДлительныеОперацииВызовСервера.ЗапуститьФоновоеЗадание(ИмяМетода, МассивПараметровМетода, Наименование);
	Если ОткрыватьФормуДлительноОперации Тогда            
		ПараметрыФормыДО = Новый Структура;
		ПараметрыФормыДО.Вставить("АдресРезультата", СтруктураПараметровДЗ.АдресРезультата);
		ПараметрыФормыДО.Вставить("ДлительнаяОперация", ФЗ);
		ПараметрыФормыДО.Вставить("ЗаголовокОперации", Наименование);
		ОткрытьФорму("ОбщаяФорма.ФормаДлительнойОперации", ПараметрыФормыДО,,,,,ОповещениеПослеОбновления);	
	КонецЕсли;
	
	Возврат ФЗ;
КонецФункции

Функция ФоновоеЗаданиеАктивно(ИмяМетода) Экспорт
	Возврат ДлительныеОперацииВызовСервера.ФоновоеЗаданиеАктивно(ИмяМетода);
КонецФункции


	
