Процедура СохранитьИдентификаторПодписчика(ИдентификаторПодписчика) Экспорт
	Подписчик = Новый ХранилищеЗначения(ИдентификаторПодписчика, Новый СжатиеДанных(6));
	Константы.ИдентификаторПодписчика.Установить(Подписчик)
КонецПроцедуры

Функция ПолучитьИдентификаторПодписчика(ИдентификаторПодписчика) Экспорт
	ХЗ = Константы.ИдентификаторПодписчика.Получить();
	Возврат ХЗ.Получить();
КонецФункции

Процедура ПриЗасыпанииКлиентскогоПриложения() Экспорт
	//АвторизацияВыполнена = ЛОЖЬ;
КонецПроцедуры

Процедура УстановитьПараметрСеанса(ИмяПараметра, ЗначениеПараметра) Экспорт
	ПараметрыСеанса[ИмяПараметра] = ЗначениеПараметра;
КонецПроцедуры

Функция ПолучитьЗначениеПараметраСеанса(ИмяПараметра) Экспорт
	Возврат ПараметрыСеанса[ИмяПараметра];	
КонецФункции
