
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Номер = Параметры.Номер;
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ПриИзмененииНомераНаКлиенте()
КонецПроцедуры

&НаКлиенте
Процедура КнопкаНажата(Команда)
	Номер = Номер + СтрЗаменить(Команда.Имя, "КнопкаНажата", "");
КонецПроцедуры

&НаКлиенте
Процедура НомерВведен(Команда)
	ЭтаФорма.Закрыть(Номер);
КонецПроцедуры

&НаКлиенте
Процедура Стереть(Команда)
	Если ЗначениеЗаполнено(Номер) Тогда
		Номер = Сред(номер,1, СтрДлина(Номер)-1);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	ОбщегоНазначенияКлиент.ЗаполнитьСвойстваФормыПриИзмененииПараметровЭкрана(ЭтаФорма);
КонецПроцедуры
