Процедура ОткрытьФормуВыбораПакетаДляЭлементаШтабеля(ФормаВладелец, ВыбранныйШтабель, ЭлементШтабеля, РядыЯчейки, ПакетыНаВилах = Неопределено) Экспорт
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("РежимВыбора", ИСТИНА);
	
	СтрокаОписания = ПолучитьСтрокуОписанияЭлементаФормыНаКлиенте(ЭлементШтабеля.Имя, РядыЯчейки);
	Если НЕ СтрокаОписания = Неопределено Тогда
		ПараметрыОткрытияФормы.Вставить("Пакет", СтрокаОписания.Пакет);
	КонецЕсли;  
	
	ДопПараметрыПослеВыбора = Новый Структура();
	ДопПараметрыПослеВыбора.Вставить("ВыбранныйШтабель", ВыбранныйШтабель);
	ДопПараметрыПослеВыбора.Вставить("РядыЯчейки", РядыЯчейки);
	ДопПараметрыПослеВыбора.Вставить("ЭлементШтабеля", ЭлементШтабеля);
	ДопПараметрыПослеВыбора.Вставить("ПакетыНаВилах", ПакетыНаВилах);

	
	ОповещениеПослеВыбора = Новый ОписаниеОповещения("ПослеВыбораПакетаИнтерактивно", ЯчейкиСкладаКлиент, ДопПараметрыПослеВыбора);
	
	ОткрытьФорму("ОбщаяФорма.ФормаПакета", ПараметрыОткрытияФормы, ФормаВладелец,,,,ОповещениеПослеВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры  

Функция ПолучитьСтрокуОписанияЭлементаФормыНаКлиенте(ИмяЭлемента, ТаблицаОписания) Экспорт
	СтрПакета = ТаблицаОписания.НайтиСтроки(Новый Структура("ИмяЭлементаФормы", ИмяЭлемента));
	Если СтрПакета.Количество() = 0 Тогда 
		Возврат Неопределено
	КонецЕсли;
	Возврат СтрПакета[0]
КонецФункции

Функция ПолучитьСтрокуОписанияЭлементаФормыНаКлиентеПоИД(ПакетID, ТаблицаОписания) Экспорт
	СтрПакета = ТаблицаОписания.НайтиСтроки(Новый Структура("ПакетID", ПакетID));
	Если СтрПакета.Количество() = 0 Тогда 
		Возврат Неопределено
	КонецЕсли;
	Возврат СтрПакета[0]
КонецФункции

Процедура ПослеВыбораПакетаИнтерактивно(ПакетID, ДопПараметры) Экспорт
	Если ПакетID = Неопределено Тогда Возврат КонецЕсли; 
	ВыбранныйШтабель = ДопПараметры.ВыбранныйШтабель;
	РядыЯчейки = ДопПараметры.РядыЯчейки;
	ЭлементШтабеля = ДопПараметры.ЭлементШтабеля;
	
	Если Не ТипЗнч(ЭлементШтабеля) = Тип("ДекорацияФормы") Тогда Возврат КонецЕсли;
	
	СтрокиРядов = РядыЯчейки.НайтиСтроки(Новый Структура("ИмяЭлементаФормы", ЭлементШтабеля.Имя));
	
	Если НЕ СтрокиРядов.Количество() = 0 Тогда
		РезультатРазмещения = РазместитьПакетВЯчейкеКлиент(ПакетID, ВыбранныйШтабель, СтрокиРядов[0].Ряд, СтрокиРядов[0].Уровень, ИСТИНА);
		ЯчейкиСкладаВызовСервера.УбратьПакетСВил(ПакетID);
	ИначеЕсли ДопПараметры.Свойство("ПакетыНаВилах") Тогда
		СтрокиВил = ДопПараметры.ПакетыНаВилах.НайтиСтроки(Новый Структура("ИмяЭлементаФормы", ЭлементШтабеля.Имя));
		Если НЕ СтрокиВил.Количество() = 0 Тогда 
			ЯчейкиСкладаВызовСервера.ДобавитьПакетНаВилы(ПакетID);
			РазместитьПакетВЯчейкеКлиент(ПакетID, ДопПараметры.ВыбранныйШтабель, 0, 0, ЛОЖЬ);
		КонецЕсли; 
	КонецЕсли;
	Оповестить("ИзмененыПакетыНаВилах");

КонецПроцедуры 

Асинх Функция НачатьРазмещениеПакетаВЯчейкеКлиентАсих(Знач Пакет, Знач Ячейка, Знач Ряд, Знач Уровень) Экспорт
	
	УспехРазмещения = ЛОЖЬ;

	Если ЕстьСвязь Тогда
		Данные = НоваяСтруктураРазмещения();
		Данные.Вставить("НомерПакета", Пакет);
		Данные.Вставить("Ячейка", Ячейка);
		Данные.Ряд = Ряд;
		Данные.Уровень = Уровень;
		СвойстваЯчейки = ЯчейкиСкладаВызовСервера.СвойстваЯчейки(Ячейка); 
		Если СвойстваЯчейки = Неопределено Тогда
			Данные.Склад = ОбщегоНазначенияВызовСервераПовтИсп.Склад();
		Иначе
			Данные.Склад = СвойстваЯчейки.Ссылка; 
		КонецЕсли;
		Данные.ВремяСобытия = ТекущаяДата();
		
		УспехРазмещения = Ждать РазместитьПакетыВЯчейкеПУ(Данные);
	КонецЕсли;
	
	Если Не УспехРазмещения Тогда
		ЯчейкиСкладаВызовСервера.РазместитьПакетВЯчейке(Пакет, Ячейка, Ряд, Уровень, ЛОЖЬ, ЕстьСвязь);
	КонецЕсли;
		
//		Если Не Результат Тогда
//			ЯчейкиСкладаВызовСервера.РазместитьПакетВЯчейке(Пакет, Ячейка, Ряд, Уровень, ЛОЖЬ, ЕстьСвязь);
//		КонецЕсли;
//		
//	Иначе
//		ЯчейкиСкладаВызовСервера.РазместитьПакетВЯчейке(Пакет, Ячейка, Ряд, Уровень, ЛОЖЬ, ЕстьСвязь);
//	КонецЕсли;
	
	Возврат ИСТИНА
КонецФункции

Асинх Функция РазместитьПакетВЯчейкеКлиент(Знач Пакет, Знач Ячейка, Знач Ряд, Знач Уровень, ОповещатьОбИзменении = ИСТИНА) Экспорт
	
	РезультатРазмещения = Ждать НачатьРазмещениеПакетаВЯчейкеКлиентАсих(Пакет, Ячейка, Ряд, Уровень);
	
	Если ОповещатьОбИзменении и РезультатРазмещения = ИСТИНА Тогда                                                           
		Оповестить("ИзмененыПакетыНаВилах", Ячейка);
	КонецЕсли;
	
	Возврат ИСТИНА
КонецФункции

Функция СтильДекорацииВыделенныйПакет() Экспорт
	Возврат Новый Структура("ЦветТекста,ЦветРамки", WebЦвета.Красный, WebЦвета.Красный)	
КонецФункции

Функция СтильДекорацииОбычныйПакет() Экспорт
	Возврат Новый Структура("ЦветТекста,ЦветРамки", WebЦвета.ТемноЗеленый, WebЦвета.ТемноЗеленый)	
КонецФункции

Функция ПолучитьЭлементКартинкиПоКоманде(Форма, Элементы, Команда) Экспорт
	Перем ЭлементКартинки;
	
	ИмяКоманды = Команда.Имя;
	Для Каждого м из Форма.СуффиксыДобавленныхКоманд() Цикл
		Если СтрНайти(ИмяКоманды, м.Ключ) > 0 Тогда
			мИмяТекущегоЭлемента = СтрЗаменить(Команда.Имя, м.Ключ, "");
			ЭлементКартинки = Элементы.Найти(мИмяТекущегоЭлемента);
			Возврат ЭлементКартинки;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Асинх Процедура НачатьОбновлениеПакетовЯчейки(Ячейка, ЕстьСвязь) Экспорт
	Если ЕстьСвязь Тогда
		ЯчейкиСкладаВызовСервера.ОбновитьПакетыЯчейкиНаСервере(Ячейка, ЕстьСвязь);
		Оповестить("ОбновлениеПакетовЯчейки", Ячейка);
	КонецЕсли;
КонецПроцедуры

Функция НоваяСтруктураРазмещения()
	Возврат Новый Структура("Склад,НомерПакета,Ячейка,Ряд,Уровень,ВремяСобытия");
КонецФункции 

Асинх Функция РазместитьПакетыВЯчейкеПУ(Знач ДанныеРазмещений) Экспорт
    МассивДанных = Новый Массив;
    
    Если ТипЗнч(ДанныеРазмещений) = Тип("Массив") Тогда
		Для Каждого стр из ДанныеРазмещений Цикл
			МассивДанных.Добавить(ЯчейкиСкладаВызовСервера.ПривестиДанныеКСериализуемомуВиду(стр));
		КонецЦикла;
	Иначе
		МассивДанных.Добавить(ЯчейкиСкладаВызовСервера.ПривестиДанныеКСериализуемомуВиду(ДанныеРазмещений));
	КонецЕсли;
	
	Если ЕстьСвязь Тогда 
		Ответ = Ждать http_Клиент.post_Асинх("/hs/ma_bgp/set_packets",,МассивДанных); 
		Если НЕ ТипЗнч(Ответ) = Тип("HTTPОтвет") Тогда
			ИсторияРаботы_ВызовСервера.мЗаписьИстории();ТекстОшибки = "Нет связи с ПУ";
			Возврат ЛОЖЬ;	
		ИначеЕсли Ответ.КодСостояния = 200 Тогда
			МассивЯчеек = Новый Массив;
			ЯчейкиСкладаВызовСервера.ОбновитьОстаткиЯчеекИзОтветаПУ(Ответ.ПолучитьТелоКакСтроку(), МассивЯчеек);
			Для Каждого Ячейка из МассивЯчеек Цикл
				Оповестить("ИзменениеРазмещенияПакета", Новый Структура("Ячейка,Обновить", Ячейка, ИСТИНА));
			КонецЦикла;
			
			Возврат ИСТИНА;
		Иначе
			ТекстОшибки = Ответ.ПолучитьТелоКакСтроку();
			Возврат ЛОЖЬ;
		КонецЕсли;
	Иначе
		Возврат ЛОЖЬ
	КонецЕсли;
	
КонецФункции
