
&НаКлиенте
Процедура ПоврежденныеПакетыОбработкаЗапросаОбновления()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	ОбщегоНазначенияКлиент.ЗаполнитьСвойстваФормыПриИзмененииПараметровЭкрана(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	//vlp_ОбработкаОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник);

КонецПроцедуры


#Область ПодключаемыеОбработчики


&НаКлиенте
Процедура Подключаемый_ВыгрузитьИзменения() Экспорт
	ЕстьСвязь = http_Клиент.ЕстьСвязь();
	Если ЕстьСвязь Тогда
		СлужебныйОбновлениеВызовСервера.НачатьОбменФоново(100);
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура АвтоОтправкаПакетовПриИзменении(Элемент)
	ЗадатьВопросИзменитьКонстантуПУ()
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗадатьВопросИзменитьКонстантуПУ()
	Если АвтоОтправкаПакетов Тогда
		ТекстВопроса = "Включить автоматическую отправку пакетов на ОТК";	
	Иначе
		ТекстВопроса = "Отключить автоматическую отправку пакетов на ОТК";	
	КонецЕсли;
	
	Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьЗначениеКонстантыПУ(АвтоОтправкаПакетов)		
	Иначе
		АвтоОтправкаПакетов = Не АвтоОтправкаПакетов		
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_ОбновитьЗначениеКонстантыИзПУ() Экспорт
	ЗаполнитьЗначениеКонстантыПУ();	
КонецПроцедуры


&НаКлиенте
Асинх Процедура ЗаполнитьЗначениеКонстантыПУ(НовоеЗначение = Неопределено)
	
	Если НовоеЗначение = Неопределено Тогда
		Ответ = Ждать http_Клиент.get_Асинх("/hs/ma_bgp/otk");
	Иначе
		Ответ = Ждать http_Клиент.post_Асинх("/hs/ma_bgp/otk",, АвтоОтправкаПакетов)
	КонецЕсли;
	
	Если Не ТипЗнч(Ответ) = Тип("Обещание") Тогда
		Если Не Ответ.КодСостояния = 200 Тогда
			АвтоОтправкаПакетов = Не АвтоОтправкаПакетов;
			Возврат
		КонецЕсли;
		
		ДанныеОтвета = http_Клиент.ИзвлечьДанныеИзОтветаСервера(Ответ);
		
		АвтоОтправкаПакетов = ДанныеОтвета;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьЗначениеКонстантыПУ();
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьЗначениеКонстантыИзПУ", 15);
КонецПроцедуры



#КонецОбласти