Функция ПакетПоврежден(Знач НомерПакета) Экспорт
	Возврат ПоврежденныеПакеты.ПакетПоврежден(НомерПакета);
КонецФункции

Функция ПодготовитьСтроку_ДанныеПовреждений(Форма) Экспорт
	Соотв = Новый Соответствие;
	РеквизитыФормы = Форма.ПолучитьРеквизиты();
	Для Каждого рекв из РеквизитыФормы Цикл
		Если Лев(Рекв.Имя, 2) = "м_" Тогда
			Соотв.Вставить(Рекв.Имя, Форма[Рекв.Имя])
		КонецЕсли;
	КонецЦикла;
	Возврат json.ЗаписатьВСтрокуJSON(Соотв);	
КонецФункции

Процедура ЗаполнитьФормуИзСтроки_ДанныеПовреждений(Форма, СтрокаПовреждений) Экспорт
	РеквизитыФормы = Форма.ПолучитьРеквизиты();
	Если ЗначениеЗаполнено(СтрокаПовреждений) Тогда
		ДанныеПовреждений = json.ПрочитатьДанныеJSONизСтроки(СтрокаПовреждений);
	Иначе
		ДанныеПовреждений = Новый Соответствие;
	КонецЕсли;
	
	Для Каждого рекв из РеквизитыФормы Цикл
		Если Лев(Рекв.Имя, 2) = "м_" Тогда
			ЗначениеИзСтроки = ДанныеПовреждений.Получить(Рекв.Имя);
			Если ЗначениеИзСтроки = Неопределено Тогда
				Форма[Рекв.Имя] = рекв.ТипЗначения.ПривестиЗначение()
			Иначе
				Форма[Рекв.Имя] = ЗначениеИзСтроки
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

	