#Область ПрограммныйИнтерфейс
// М запись истории.
// 
// Параметры:
//  ИмяСобытия - Строка - Имя события
//  Примечание - Строка - Примечание
//  Ошибка - Булево - Ошибка
Процедура мЗаписьИстории(ИмяСобытия, Примечание = "", Ошибка = ЛОЖЬ) Экспорт
	УстановитьПривилегированныйРежим(ИСТИНА);
	
	МенеджерЗаписи = РегистрыСведений.ИсторияРаботы.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИмяСобытия = ИмяСобытия;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДатаСеанса();
	МенеджерЗаписи.Ошибка = Ошибка;
	МенеджерЗаписи.Примечание = Примечание;
	МенеджерЗаписи.Записать(ИСТИНА);
	
КонецПроцедуры
#КонецОбласти
