
&НаКлиенте
Процедура ИнструкцияПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.Инструкция.ТекущиеДанные; 
	Если ТекДанные = НЕОПРЕДЕЛЕНО Тогда
		ПолноеОписаниеСтроки = "";
		Элементы.ПолноеОписаниеСтроки.Доступность = ЛОЖЬ;
	Иначе
		ПолноеОписаниеСтроки = ТекДанные.Описание;
		Элементы.ПолноеОписаниеСтроки.Доступность = ИСТИНА;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолноеОписаниеСтрокиПриИзменении(Элемент)
	ТекДанные = Элементы.Инструкция.ТекущиеДанные;
	ТекДанные.Описание = ПолноеОписаниеСтроки;
КонецПроцедуры
