Процедура ЗаписатьДанные(ID_Ссылки, ТипВладельца, Наименование, Описание, Расширение, АдресХранилищаДД) Экспорт
	ДД = ПолучитьИзВременногоХранилища(АдресХранилищаДД);

	Запись = РегистрыСведений.ДвоичныеДанныеПрисоединенныхФайлов.СоздатьМенеджерЗаписи();
	НаборСуществующих = СписокФайловСсылки(ID_Ссылки, ТипВладельца, Наименование);
	Если НаборСуществующих.Количество() > 0 Тогда
		ID_Файла = НаборСуществующих[0].ID_Файла;
	Иначе
		ID_Файла = Новый УникальныйИдентификатор;
	КонецЕсли;
    Запись.БазаПУ		 = ОбщегоНазначенияВызовСервераПовтИсп.БазаПУ();
	Запись.ID_Ссылки	 = ID_Ссылки;
	Запись.ID_Файла		 = ID_Файла;
	Запись.ТипВладельца	 = ТипВладельца;
	Запись.Наименование	 = Наименование;
	Запись.Описание		 = Описание;
	
	Запись.Расширение = Расширение;
	Запись.Base64 = Base64Строка(ДД); 
	
	Запись.Записать(ИСТИНА);
	
КонецПроцедуры

Функция СписокФайловСсылки(ID_Ссылки, ТипВладельца, Наименование)
	НЗ = РегистрыСведений.ДвоичныеДанныеПрисоединенныхФайлов.СоздатьНаборЗаписей();
	НЗ.Отбор.ID_Ссылки.Установить(ID_Ссылки);
	Если ЗначениеЗаполнено(ТипВладельца) Тогда
		НЗ.Отбор.ТипВладельца.Установить(ТипВладельца);
	КонецЕсли;
	Если ЗначениеЗаполнено(Наименование) Тогда
		НЗ.Отбор.Наименование.Установить(Наименование);
	КонецЕсли;
	НЗ.Прочитать();
	Возврат НЗ;
КонецФункции

