
&НаКлиенте
Процедура ПакетыСборкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьПакетыСборки()
КонецПроцедуры

&НаСервере
Процедура ОбновитьПакетыСборки()
	ПакетыСборки.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НазначенныеПодсборки.Пакет КАК Пакет,
	|	ОстаткиПакетовНаСкладах.Ячейка КАК Ячейка,
	|	ОстаткиПакетовНаСкладах.Объем КАК Объем,
	|	ОстаткиПакетовНаСкладах.Досок КАК Досок,
	|	ОстаткиПакетовНаСкладах.Ряд КАК Ряд,
	|	ОстаткиПакетовНаСкладах.Уровень КАК Уровень,
	|	СвойстваПакетов.Сечение КАК Сечение,
	|	СвойстваПакетов.ДлинаТ КАК ДлинаТ,
	|	СвойстваПакетов.Порода КАК Порода,
	|	СвойстваПакетов.Номер КАК Номер
	|ИЗ
	|	РегистрСведений.НазначенныеПодсборки КАК НазначенныеПодсборки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОстаткиПакетовНаСкладах КАК ОстаткиПакетовНаСкладах
	|		ПО НазначенныеПодсборки.Пакет = ОстаткиПакетовНаСкладах.НомерПакета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваПакетов КАК СвойстваПакетов
	|		ПО НазначенныеПодсборки.Пакет = СвойстваПакетов.НомерПакета
	|ГДЕ
	|	НазначенныеПодсборки.Место = &Место";
	Запрос.УстановитьПараметр("Место", Запись.Место);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Нов = ПакетыСборки.Добавить();
		Нов.Пакет = Выборка.Пакет;
		Нов.Описание = ЯчейкиСклада.ОписаниеПакета(Нов.Пакет, Выборка);
		Нов.ДлинаТ = Выборка.ДлинаТ;
		Нов.Сечение = Выборка.Сечение;
		Нов.Порода = Выборка.Порода;
		Нов.Адрес = ЯчейкиСклада.АдресПакета(Выборка.Ячейка, Выборка.Ряд, Выборка.Уровень);
	КонецЦикла;
	
КонецПроцедуры
