
&НаКлиенте
Процедура ЗафиксироватьДубль(Команда)
	Если ПроверитьЗаполнение() Тогда
		Пар = Новый Структура("НомерПакета,Гео,Штабель,Ряд,Ярус");
		ЗаполнитьЗначенияСвойств(Пар, ЭтаФорма);
		ЭтаФорма.Закрыть(Пар);   
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.ПараметрыСтроки <> НЕОПРЕДЕЛЕНО и ЗначениеЗаполнено(Параметры.ПараметрыСтроки) Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ПараметрыСтроки);	
	КонецЕсли;
	
КонецПроцедуры
