Функция Склад() Экспорт
	Возврат ОбщегоНазначенияВызовСервераПовтИсп.Склад();
КонецФУнкции

Функция БазаПУ() Экспорт
	Возврат ОбщегоНазначенияВызовСервераПовтИсп.БазаПУ();
КонецФУнкции

Функция СвойстваБазыПУ() Экспорт
	Возврат ОбщегоНазначенияВызовСервераПовтИсп.БазаПУ();
КонецФУнкции

Функция ПериодичностьПолученияОстатковСклада() Экспорт
	Возврат ОбщегоНазначенияВызовСервераПовтИсп.ПериодичностьПолученияОстатковСклада();
КонецФункции

Функция ПериодичностьВыгрузкиИзменений() Экспорт
	Возврат ОбщегоНазначенияВызовСервераПовтИсп.ПериодичностьВыгрузкиИзменений();
КонецФункции

Функция ДанныеУстройства() Экспорт;
	Возврат ОбщегоНазначенияВызовСервераПовтИсп.ДанныеУстройства();
КонецФункции

Функция АдресПинга() Экспорт
	Возврат МобильноеПриложениеСкладПУВызовСервера.ПолучитьАдресДляПинг();
КонецФункции

Функция ДанныеПинга() Экспорт
	СвойстваБазы = ОбщегоНазначенияВызовСервераПовтИсп.СвойстваБазыПУ();
	Возврат Новый ФиксированнаяСтруктура(Новый Структура("АдресДляPing, Таймаут, https", СвойстваБазы.АдресДляPing,3,СвойстваБазы.https));
КонецФункции

Функция ЭтоERP() Экспорт
	Возврат ОбщегоНазначенияВызовСервераПовтИсп.ЭтоERP();	
КонецФункции
