Функция ЗапуститьФоновоеЗадание(ИмяМетода, ПараметрыЗадания, Наименование) Экспорт
	Если ФоновоеЗаданиеАктивно(ИмяМетода) Тогда
		Возврат Неопределено
	Иначе
		ФЗ = ФоновыеЗадания.Выполнить(ИмяМетода, ПараметрыЗадания, ИмяМетода, Наименование);
		Возврат ФЗ.УникальныйИдентификатор;
	КонецЕсли;
КонецФункции

Функция ФоновоеЗаданиеАктивно(ИмяМетода) Экспорт
	Возврат ДлительныеОперации.ФоновоеЗаданиеАктивно(ИмяМетода);	
КонецФункции

Функция ФоновоеЗаданиеСсылкаАктивно(ФоновоеЗаданиеСсылка) Экспорт
	Возврат ФоновоеЗаданиеСсылка.Состояние = СостояниеФоновогоЗадания.Активно;	
КонецФункции

Функция ФоновоеЗаданиеID_Активно(ФоновоеЗаданиеID) Экспорт
	Возврат ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ФоновоеЗаданиеID).Состояние = СостояниеФоновогоЗадания.Активно;	
КонецФункции