Процедура ОбновитьРегистрПоЗаданиямНаВывоз() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаданияНаВывозВПодсборки.Подсборка КАК Подсборка,
	|	ЗаданияНаВывозВПодсборки.МассивИдПакетов КАК МассивИдПакетов,
	|	ЗаданияНаВывозВПодсборки.НомерЗаявки КАК НомерЗаявки,
	|	ЗаданияНаВывозВПодсборки.Покупатель КАК Покупатель,
	|	ЗаданияНаВывозВПодсборки.Комментарий КАК Комментарий
	|ИЗ
	|	Константа.АдресПУ КАК АдресПУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗаданияНаВывозВПодсборки КАК ЗаданияНаВывозВПодсборки
	|		ПО АдресПУ.Значение = ЗаданияНаВывозВПодсборки.БазаПУ
	|ГДЕ
	|	НЕ ЗаданияНаВывозВПодсборки.Выполнено";
	Выборка = Запрос.Выполнить().Выбрать();
	НЗ = РегистрыСведений.НазначенныеПодсборки.СоздатьНаборЗаписей();
	НЗ.Отбор.Склад.Установить(ОбщегоНазначенияВызовСервераПовтИсп.Склад());
	Пока Выборка.Следующий() Цикл 
		МассивИД = Выборка.МассивИдПакетов.Получить();
		Для Каждого ид из МассивИД Цикл
			Нов = НЗ.Добавить();
			Нов.Склад = ОбщегоНазначенияВызовСервераПовтИсп.Склад();
			Нов.Активность = Истина;
			Нов.Комментарий = Выборка.Комментарий;
			Нов.Покупатель = Выборка.Покупатель;
			Нов.НомерСпецификации = Выборка.НомерЗаявки;
			Нов.Пакет = Ид;
			Нов.Место = Выборка.Подсборка;
		КонецЦикла;
	КонецЦикла;
	НЗ.Записать(ИСТИНА);
КонецПроцедуры
