
Процедура ПриЗаписиДляРегистрацииВПланеОбменаПриЗаписи(Источник, Отказ, Замещение) Экспорт
	Если Источник.ОбменДанными.Загрузка = ИСТИНА Тогда
		Возврат 
	КонецЕсли;                                                               
	
КонецПроцедуры

Процедура ПередЗаписьюДляРегистрацииВПланеОбмена(Источник, Отказ, Замещение) Экспорт
	
	Если Источник.ОбменДанными.Загрузка = ИСТИНА Тогда
		Источник.ОбменДанными.Получатели.Автозаполнение = Ложь;
		Источник.ОбменДанными.Получатели.Очистить();
		Возврат 
	КонецЕсли;  
	
	УспехОнлайнВыгрузки = ЛОЖЬ;
	ТипИсточника = Тип(Источник); 
	Если ТипИсточника = Тип("РегистрСведенийНаборЗаписей.ОстаткиПакетовНаСкладах") Тогда
		
		Если Источник.ДополнительныеСвойства.Свойство("ИзмененияНеВыгружатьСразу") и Источник.ДополнительныеСвойства.ИзмененияНеВыгружатьСразу Тогда
			
		Иначе
			Если Источник.ДополнительныеСвойства.Свойство("ЕстьСвязь") и Источник.ДополнительныеСвойства.ЕстьСвязь Тогда
				ПроверятьСвязь = ЛОЖЬ;
			Иначе
				ПроверятьСвязь = ИСТИНА;
			КонецЕсли;
			
			Если Не ПроверятьСвязь или http.ЕстьСвязь() Тогда
				Вт = Источник.Выгрузить();
				МассивДанных = ОбщегоНазначения.ТаблицаЗначенийВМассив(Вт);
				
				УспехОнлайнВыгрузки = ЯчейкиСклада.ВыполнитьРазмещениеПакетовВПУ(МассивДанных, "", ЛОЖЬ);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

	Источник.ОбменДанными.Получатели.Автозаполнение = Ложь;
	Источник.ОбменДанными.Получатели.Очистить();
	Если Не УспехОнлайнВыгрузки Тогда
		Источник.ОбменДанными.Получатели.Добавить(ОбщегоНазначенияВызовСервераПовтИсп.БазаПУ().УзелПланаОбмена)
	КонецЕсли;
	
КонецПроцедуры
