
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(Параметры.ДлительнаяОперация) Тогда
		ЭтаФорма.Закрыть();	
	КонецЕсли;
	Если Параметры.Свойство("ЗаголовокОперации") Тогда
		Элементы.ДекорацияЗаголовка.Заголовок = Параметры.ЗаголовокОперации;
	КонецЕсли;

	Таймаут = 1;
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", Таймаут);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	ОтключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания");
	Если ЗаданиеВыполнено() Тогда
		ЭтаФорма.Закрыть(Параметры.АдресРезультата);	
	Иначе
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", Окр(Таймаут * 1.8,2));	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаданиеВыполнено()
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Параметры.ДлительнаяОперация);
	Возврат НЕ (Задание.Состояние = СостояниеФоновогоЗадания.Активно)
КонецФункции