Функция ЗаписатьВСтрокуJSON(Знач ДанныеДляТелаЗапроса) Экспорт
	Возврат json.ЗаписатьВСтрокуJSON(ДанныеДляТелаЗапроса);
КонецФункции

Функция ПрочитатьДанныеJSONизСтроки(Знач СтрокаJSON) Экспорт
	Возврат json.ПрочитатьДанныеJSONизСтроки(СтрокаJSON);
КонецФункции

Функция ЗаписатьВСтрокуJSON_СериализаторXDTO(Знач ДанныеДляТелаЗапроса) Экспорт
	Возврат json.ЗаписатьВСтрокуJSON_СериализаторXDTO(ДанныеДляТелаЗапроса);
КонецФункции

Функция ПрочитатьДанныеJSONизСтроки_СериализаторXDTO(Знач СтрокаJSON) Экспорт
	Возврат json.ПрочитатьДанныеJSONизСтроки_СериализаторXDTO(СтрокаJSON);
КонецФункции
