Функция ПолучитьТекущиеПартии() Экспорт
	Если ОбщегоНазначенияВызовСервераПовтИсп.БазаПУ().ЭтоERP Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(pu_ПартияСортировкиПиломатериалов.Ссылка) КАК id,
		|	pu_ПартияСортировкиПиломатериалов.Номер КАК Номер,
		|	pu_ПартияСортировкиПиломатериалов.Дата КАК Дата,
		|	pu_ПартияСортировкиПиломатериалов.Сечение.Наименование КАК Сечение,
		|	pu_ПартияСортировкиПиломатериалов.Порода.Наименование КАК Порода,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(pu_ПартияСортировкиПиломатериалов.ВидПродукции) КАК ВидПродукции
		|ИЗ
		|	Документ.pu_ПартияСортировкиПиломатериалов КАК pu_ПартияСортировкиПиломатериалов
		|ГДЕ
		|	pu_ПартияСортировкиПиломатериалов.Состояние = ЗНАЧЕНИЕ(Перечисление.pu_СтатусыСостоянияПартий.ВРаботе)
		|	И НЕ pu_ПартияСортировкиПиломатериалов.Архивный"
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	УникальныйИдентификатор(VLP_ПартияСортировкиПиломатериалов.Ссылка) КАК id,
		|	VLP_ПартияСортировкиПиломатериалов.Номер КАК Номер,
		|	VLP_ПартияСортировкиПиломатериалов.Дата КАК Дата,
		|	VLP_ПартияСортировкиПиломатериалов.Сечение.Наименование КАК Сечение,
		|	Выбор Когда VLP_ПартияСортировкиПиломатериалов.Порода = Значение(Перечисление.VLP_ПородыДревесины.Ель) Тогда ""Ель"" Иначе ""Сосна"" Конец КАК Порода,
		|	УникальныйИдентификатор(VLP_ПартияСортировкиПиломатериалов.ВидПродукции) КАК ВидПродукции
		|ИЗ
		|	Документ.VLP_ПартияСортировкиПиломатериалов КАК VLP_ПартияСортировкиПиломатериалов
		|ГДЕ
		|	VLP_ПартияСортировкиПиломатериалов.Состояние = Значение(Перечисление.VLP_СостоянияПартийСортировки.ВРаботе)
		|	И НЕ VLP_ПартияСортировкиПиломатериалов.Архивный";
	КонецЕсли;
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("ТекстЗапроса", ТекстЗапроса);
	СтруктураЗапроса.Вставить("ПараметрыЗапроса", Новый Массив());
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "charset="+УКО.ТипКодировки());
	
	ДанныеПУ = УКО.ВыполнитьЗапрос("random_query","POST", Заголовки, СтруктураЗапроса); 
	Возврат ДанныеПУ;
КонецФункции

Процедура ЗаписатьИзмененияРазмещенияПартии(ДанныеПартии) Экспорт

	сПартии = Новый Соответствие;
	ОписаниеСортов = Новый Массив;
	Для Каждого стр из ДанныеПартии Цикл
		ОписаниеСортов.Добавить(Новый Структура("Сорт, ДлинаОт, ДлинаДо, Штабеля", стр.Сорт.УникальныйИдентификатор(), стр.ДлинаОт, Стр.ДлинаДо, стр.Ячейки));
	КонецЦикла;
	сПартии.Вставить(ДанныеПартии[0].Партия, ОписаниеСортов);
	
	Ответ = http.post("/hs/ma_bgp/parties_set", сПартии);
	
КонецПроцедуры

Функция ПолучитьРазмещениеПартииИзПУ(id) Экспорт
	
	Ответ = http.get("/hs/ma_bgp/parties_set/"+XMLСтрока(id));
	Если Ответ = Неопределено или НЕ Ответ.КодСостояния = 200 Тогда
		Возврат НЕОПРЕДЕЛЕНО
	КонецЕсли;
	
	ДанныеПУ = УКО.ПрочитатьДанныеJSONизСтроки(Ответ.ПолучитьТелоКакСтроку()); 
	Возврат  ДанныеПУ;
	
КонецФункции
