Функция НовыйЭлементХТМЛ(Тег, мСвойства = Неопределено, Подчиненные = Неопределено, Текст = "") Экспорт
	Описание = Новый Структура;
	Описание.Вставить("тег", Тег);
	
	Если мСвойства = Неопределено Тогда
		Описание.Вставить("Свойства", Новый Соответствие);
	Иначе
		Описание.Вставить("Свойства", мСвойства);
	КонецЕсли;
	
	Если Подчиненные = Неопределено Тогда
		Описание.Вставить("Подчиненные", Новый Массив);
	Иначе
		Описание.Вставить("Подчиненные", Подчиненные);
	КонецЕсли;
	
	Если Текст = "" Тогда
		Описание.Вставить("Текст", "");
	Иначе
		Описание.Вставить("Текст", Текст);
	КонецЕсли;
	
	Возврат Описание;
КонецФункции

Функция ТекстЭлементаХТМЛ(Описание) Экспорт
	ОткрывающийТег = Новый Массив;
	Если ЗначениеЗаполнено(Описание.Тег) Тогда
		ОткрывающийТег.Добавить(Описание.Тег);
		Для Каждого эл из Описание.Свойства Цикл
			ОткрывающийТег.Добавить(""+эл.Ключ+"="+	ЗначениеВКавычках(эл.Значение))
		КонецЦикла;
		ТекстТега = "<" + СтрСоединить(ОткрывающийТег," ")+">";
		Для Каждого Подч из Описание.Подчиненные Цикл
			ТекстТега = ТекстТега + Символы.ПС
			+ ТекстЭлементаХТМЛ(Подч);
		КонецЦикла; 
		Если ЗначениеЗаполнено(Описание.Текст) Тогда
			ТекстТега = ТекстТега + Символы.ПС + Описание.Текст;
		КонецЕсли;
		ТекстТега = ТекстТега + ?(СтрЧислоСтрок(ТекстТега) = 1,"",Символы.ПС) + "</"+Описание.Тег+">";
	Иначе
		ТекстТега = Описание.Текст;
	КонецЕсли;
	Возврат ТекстТега;
КонецФункции

Функция ЗначениеВКавычках(Знач мЗначение) Экспорт
	Если ТипЗнч(мЗначение) = Тип("Число") Тогда
		мЗначение = Формат(мЗначение, "ЧН=0; ЧГ=0")
	Иначе
		мЗначение = Строка(мЗначение);	
	КонецЕсли;
	Возврат Символ(34)+мЗначение+Символ(34);
КонецФункции

Функция ОсновнойШаблонСтраницы() Экспорт
	Возврат 
	"<html>
	|<head>
	|<style>
	|<!--####style
	|</style>
	|</head>
	|<body>
	|<!--####body
	|</body>
	|</html>";
	
КонецФункции