
&НаКлиенте
Процедура АктивныеСборкиОбработкаЗапросаОбновления()
	ОбновитьАктивныеСборки();
КонецПроцедуры

&НаСервере
Процедура ОбновитьАктивныеСборки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НазначенныеПодсборки.Место КАК Место,
	|	НазначенныеПодсборки.НомерСпецификации КАК НомерСпецификации,
	|	НазначенныеПодсборки.Покупатель КАК Покупатель,
	|	НазначенныеПодсборки.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.НазначенныеПодсборки КАК НазначенныеПодсборки
	|ГДЕ
	|	НазначенныеПодсборки.Склад В (&Склады)
	|
	|СГРУППИРОВАТЬ ПО
	|	НазначенныеПодсборки.НомерСпецификации,
	|	НазначенныеПодсборки.Покупатель,
	|	НазначенныеПодсборки.Место,
	|	НазначенныеПодсборки.Комментарий";
	Запрос.УстановитьПараметр("Склады", ОбщегоНазначенияВызовСервераПовтИсп.МассивСкладов());
	Выборка = Запрос.Выполнить().Выбрать();
	АктивныеСборки.Очистить();
	
	Пока Выборка.Следующий() Цикл
		Нов = АктивныеСборки.Добавить();
		ЗаполнитьЗначенияСвойств(Нов, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьАктивныеСборки()
КонецПроцедуры

&НаКлиенте
Процедура АктивныеСборкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	ТекСтрока = Элементы.АктивныеСборки.ТекущиеДанные;
	Если Не ТекСтрока = Неопределено Тогда
		ОткрытьФорму("ОбщаяФорма.ФормаЗаданияНаВывозку", Новый Структура("Место", ТекСтрока.Место));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокНаСервере()
	СлужебныйОбновление.НачатьОбменИзменениями(500);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ОбновитьСписокНаСервере(); 
	Элементы.АктивныеСборки.Обновить();
КонецПроцедуры
