Функция ИсправленияПреобразованияЗаписиJSON(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	Возврат XMLСтрока(Значение)
КонецФункции

Функция ЗаписатьВСтрокуJSON(ДанныеДляТелаЗапроса) Экспорт
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	ЗаписатьJSON(Запись, ДанныеДляТелаЗапроса, Новый НастройкиСериализацииJSON(), "ИсправленияПреобразованияЗаписиJSON", json);
	ТелоСтроки = Запись.Закрыть();
	
	Возврат ТелоСтроки;
КонецФункции

Функция ПрочитатьДанныеJSONизСтроки(СтрокаJSON) Экспорт
	Перем Данные;             
	Если Не ЗначениеЗаполнено(СтрокаJSON) Тогда Возврат НЕОПРЕДЕЛЕНО КонецЕсли;
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	Попытка
		Данные = СериализаторXDTO.ПрочитатьJSON(Чтение);
	Исключение
		//Сообщить(СтрокаJSON);
	КонецПопытки; 
	Чтение.Закрыть();
	Возврат Данные;
КонецФункции

Функция ЗаписатьВСтрокуJSON_СериализаторXDTO(ДанныеДляТелаЗапроса) Экспорт
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(Новый ПараметрыЗаписиJSON);
	СериализаторXDTO.ЗаписатьJSON(Запись, ДанныеДляТелаЗапроса, НазначениеТипаXML.Явное);
	ТелоСтроки = Запись.Закрыть();
	
	Возврат ТелоСтроки;
КонецФункции

Функция ПрочитатьДанныеJSONизСтроки_СериализаторXDTO(СтрокаJSON) Экспорт
	Перем Данные;              
	Если Не ЗначениеЗаполнено(СтрокаJSON) Тогда
		Возврат НЕОПРЕДЕЛЕНО
	КонецЕсли;
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	Попытка
		Данные = СериализаторXDTO.ПрочитатьJSON(Чтение);
	Исключение
		
	КонецПопытки;
	Чтение.Закрыть();
	Возврат Данные;
КонецФункции
