

Функция ОтправитьСообщениеВТелегу(IDUser, Знач ДанныеОтправки, ОтложитьПриОшибке = ИСТИНА) Экспорт 
	
	Если ТипЗнч(ДанныеОтправки) = Тип("Строка") Тогда
	ИначеЕсли ТипЗнч(ДанныеОтправки) = Тип("ИнформацияОбОшибке") Тогда
		МассивСтрок = Новый Массив;                                    
		СистемнаяИнформация = Новый СистемнаяИнформация;
		
		МассивСтрок.Добавить("Версия приложения:"+ СистемнаяИнформация.ВерсияПриложения + "("+ Метаданные.Версия+")"+Константы.ЛогинПУ.Получить() );
		МассивСтрок.Добавить("ID:"+ПараметрыСеанса.ИдентификаторУстройства);
		МассивСтрок.Добавить(ДанныеОтправки.ИсходнаяСтрока+"("+ДанныеОтправки.ИмяМодуля+":"+ДанныеОтправки.НомерСтроки+")");
		ПричинаОшибки = ДанныеОтправки.Причина;
		//Если ДанныеОтправки.Свойство("Описание") Тогда
			МассивСтрок.Добавить(ДанныеОтправки.Описание); 
		//КонецЕсли;
		Если НЕ ПричинаОшибки = НЕОПРЕДЕЛЕНО Тогда
			ПричинаОшибки = ПричинаОшибки.Причина;
			Если ЗначениеЗаполнено(ПричинаОшибки) Тогда
				МассивСтрок.Добавить(ПричинаОшибки.Описание);
			КонецЕсли;
		КонецЕсли; 
		ДанныеОтправки = СтрСоединить(МассивСтрок, Символы.ПС);
	КонецЕсли;
	
	Попытка
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
		TokenTelegramm = ПолучитьTokenTelegramm();
		Ресурс = "bot" + TokenTelegramm + "/sendMessage?chat_id=" + СтрЗаменить(Формат(IDUser, "ЧДЦ=; ЧС=; ЧРГ=."), ".", "") + "&text= " + ДанныеОтправки;
		Соединение = Новый HTTPСоединение("api.telegram.org",443,,,,,ЗащищенноеСоединение);
		Запрос = Новый HTTPЗапрос(Ресурс);
		Ответ = Соединение.Получить(Запрос);  
		Возврат ИСТИНА;
	Исключение 
		Если ОтложитьПриОшибке Тогда
			Ошибки.Отложить(ДанныеОтправки);
		КонецЕсли;
		Возврат ЛОЖЬ
	КонецПопытки
КонецФункции

Функция ПолучитьTokenTelegramm()
	Возврат "7153029246:AAECpCkr4ycWqTmWj1tj6mc6T-H3DpXCPxE"
КонецФункции
