
Процедура ПередЗаписью(Отказ) 
	Если ЗначениеЗаполнено(ИмяПредопределенныхДанных) Тогда
		Возврат
	КонецЕсли;
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	Если Не ЗначениеЗаполнено(УзелПланаОбмена) Тогда
		Если ЗначениеЗаполнено(ВерсияДанных) Тогда
			БазаСсылка = Ссылка;
		Иначе
			БазаСсылка = Справочники.БазыПУ.ПолучитьСсылку(Новый УникальныйИдентификатор);
			УстановитьСсылкуНового(БазаСсылка);
			УзелПланаОбмена = МобильноеПриложениеСкладПУ.ПолучитьСоздатьУзелПланаОбменаПУ(БазаСсылка);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	а=1
КонецПроцедуры
