
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура ПакетыПередНачаломИзменения(Элемент, Отказ)
	ПакетыОткрытьФормуСтроки(Элементы.Пакеты.ТекущиеДанные)
КонецПроцедуры

&НаКлиенте
Процедура ПакетыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	ПакетыОткрытьФормуСтроки(Элементы.Пакеты.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПакетыОткрытьФормуСтроки(ВыбраннаяСтрока)
	
КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьСвойстваПакета(Команда)
	//ОповещениеПосле = Новый ОписаниеОповещения("ОбработатьВводНомераПакета", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ФормаПакета", Новый Структура("РежимВыбора,ПоказатьКлавиатуру", ЛОЖЬ, ЛОЖЬ), ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СканироватьПакет(Команда)
	#Если МобильноеПриложениеКлиент или МобильныйКлиент Тогда
		ОбработчикРезультата = Новый ОписаниеОповещения("ОбработатьНомерПакета", ЭтотОбъект);
		Пакеты_Клиент.НачатьСканирование1с(ОбработчикРезультата);
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНомерПакета(Результат, ДопПар) Экспорт
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьЗаголовокСтраницыПакеты()
	Отмечено = 0;
	Для Каждого стр из Объект.Пакеты Цикл
		Если стр.Факт Тогда
			Отмечено = Отмечено + 1;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.СтраницаПакеты.Заголовок = "Пакеты ("+Отмечено+" из "+ Объект.Пакеты.Количество()+")";	
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму()
	Если ЗначениеЗаполнено(Объект.ДатаНачалаИнвентаризации) Тогда 
		Элементы.НачатьИнвентаризацию.Видимость = ЛОЖЬ;
	Иначе
		Элементы.НачатьИнвентаризацию.Видимость = ИСТИНА; 
		Элементы.ЗакончитьИнвентаризацию.Видимость = ЛОЖЬ;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ДатаОкончанияИнвентаризации) Тогда  
		Элементы.ЗакончитьИнвентаризацию.Видимость = ЛОЖЬ;
	ИНаче
		Элементы.ЗакончитьИнвентаризацию.Видимость = ЗначениеЗаполнено(Объект.ДатаНачалаИнвентаризации);
	КонецЕсли;
	Элементы.ГруппаОтборовПакетов.Доступность = Не ЗначениеЗаполнено(Объект.ДатаНачалаИнвентаризации);
КонецПроцедуры


#КонецОбласти

#Область ПодключаемыеПроцедурыИФункции

#КонецОбласти


&НаКлиенте
Асинх Процедура ОтметитьНаличие(Команда)
	
	ТекДанные = Элементы.Пакеты.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		Ответ = Ждать ВопросАсинх("Отметить наличие пакета "+ТекДанные.НомерПакета+"?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда 
			ОтметитьСтрокуТЧ_ОК(ТекДанные);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокПакетов(Команда)
	НачатьОбновлениеСпискаПакетовАсинх();
КонецПроцедуры

&НаКлиенте
Асинх Процедура НачатьОбновлениеСпискаПакетовАсинх()
	ОтветНаВопрос = Ждать ВопросАсинх("Обновить список пакетов на складе?", РежимДиалогаВопрос.ДаНет);
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда 
		ЕстьИзменения = ЛОЖЬ;
		ОписаниеПакетов = ПолучитьСписокПакетовНаСервере();
		МассивСклада = ОписаниеПакетов.Пакеты;
		МассивПакетовКУдалению = ОписаниеПакетов.ПакетыКУдалению;
		Для Каждого п из МассивСклада Цикл 
			СтрокиНашли = Объект.Пакеты.НайтиСтроки(Новый Структура("НомерПакета", п.НомерПакета));
			Если СтрокиНашли.Количество() = 0 Тогда
				Нов = Объект.Пакеты.Добавить();
				ЗаполнитьЗначенияСвойств(Нов, п);
				ЕстьИзменения = ИСТИНА;
			Иначе
				СтрокиНашли[0].Адрес = п.Адрес;
			КонецЕсли;
		КонецЦикла;
		Если МассивПакетовКУдалению.Количество()>0 Тогда
			СтрокиКУдалению = Новый Массив;
			Для Каждого п из МассивПакетовКУдалению Цикл 
				СтрокиНашли = Объект.Пакеты.НайтиСтроки(Новый Структура("НомерПакета", п));
				Если СтрокиНашли.Количество() > 0 Тогда
					Если Не СтрокиНашли[0].Факт Тогда
						СтрокиКУдалению.Добавить(СтрокиНашли[0]);	
					КонецЕсли;
				КонецЕсли;
			КонецЦикла; 
			Для Каждого стр из СтрокиКУдалению Цикл
				Объект.Пакеты.Удалить(стр);
			КонецЦикла;
			ЕстьИзменения = ИСТИНА;
		КонецЕсли;
		ЭтаФорма.Модифицированность = ЕстьИзменения;
		ОбновитьЗаголовокСтраницыПакеты();
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПакетовНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиПакетовНаСкладах.НомерПакета КАК Пакет,
	|	ОстаткиПакетовНаСкладах.Объем КАК Объем,
	|	ОстаткиПакетовНаСкладах.Досок КАК Досок,
	|	ОстаткиПакетовНаСкладах.Ячейка КАК Ячейка,
	|	ОстаткиПакетовНаСкладах.Ряд КАК Ряд,
	|	ОстаткиПакетовНаСкладах.Уровень КАК Уровень,
	|	СвойстваПакетов.Сечение КАК Сечение,
	|	СвойстваПакетов.СечениеТолщина КАК Толщина,
	|	СвойстваПакетов.СечениеШирина КАК Ширина,
	|	СвойстваПакетов.ВидПродукции КАК ВидПродукции,
	|	СвойстваПакетов.Сорт КАК Сорт,
	|	СвойстваПакетов.ТипРаспила КАК ТипРаспила,
	|	СвойстваПакетов.Влажность КАК Влажность,
	|	СвойстваПакетов.ДатаВыпуска КАК ДатаВыпуска,
	|	СвойстваПакетов.Порода КАК ПородаСтр,
	|	ЗНАЧЕНИЕ(Перечисление.Породы.ПустаяСсылка) КАК Порода,
	|	СвойстваПакетов.Номер КАК НомерПакета,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(10)) КАК Адрес
	|ИЗ
	|	РегистрСведений.ОстаткиПакетовНаСкладах КАК ОстаткиПакетовНаСкладах
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваПакетов КАК СвойстваПакетов
	|		ПО ОстаткиПакетовНаСкладах.НомерПакета = СвойстваПакетов.НомерПакета
	|ГДЕ
	|	ОстаткиПакетовНаСкладах.Склад = &Склад
	|	И СвойстваПакетов.СечениеТолщина МЕЖДУ &ТолщинаОт И &ТолщинаДо
	|	И СвойстваПакетов.СечениеШирина МЕЖДУ &ШиринаОт И &ШиринаДо";
	
	Запрос.УстановитьПараметр("Склад",		 Объект.Склад);
	Запрос.УстановитьПараметр("ТолщинаОт",	 Объект.ТолщинаОт);
	Запрос.УстановитьПараметр("ТолщинаДо",	 Объект.ТолщинаДо);
	Запрос.УстановитьПараметр("ШиринаОт",	 Объект.ШиринаОт);
	Запрос.УстановитьПараметр("ШиринаДо",	 Объект.ШиринаДо); 
	Остатки = Запрос.Выполнить().Выгрузить();
	СоотвПород = Новый Соответствие;
	СоотвПород.Вставить("Ель", Перечисления.Породы.Ель);
	СоотвПород.Вставить("Сосна", Перечисления.Породы.Сосна);
	Для Каждого стр из Остатки Цикл      
		Стр.Порода = СоотвПород.Получить(стр.ПородаСтр);
		Стр.Адрес = СтрШаблон("%1/%2/%3", стр.Ячейка, стр.Ряд, стр.Уровень);
	КонецЦикла;
	
	МассивПакетовКУдалению = ОбщегоНазначенияКлиентСервер.РазностьМассивов(Объект.Пакеты.Выгрузить().ВыгрузитьКолонку("НомерПакета"), Остатки.ВыгрузитьКолонку("НомерПакета"));
	
	Возврат Новый Структура("Пакеты, ПакетыКУдалению", ОбщегоНазначения.ТаблицаЗначенийВМассив(Остатки), МассивПакетовКУдалению);
КонецФункции

&НаКлиенте
Процедура НачатьИнвентаризацию(Команда)
	Объект.ДатаНачалаИнвентаризации = ТекущаяДата(); 
	НачатьОбновлениеСпискаПакетовАсинх();
	НастроитьФорму();
КонецПроцедуры  

&НаКлиенте
Процедура ЗакончитьИнвентаризацию(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьПакетВручную(Команда)
	ОповещениеПосле = Новый ОписаниеОповещения("ОбработатьВводНомераПакета", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ФормаПакета", Новый Структура("РежимВыбора", ИСТИНА), ЭтаФорма,,,,ОповещениеПосле, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры 

&НаКлиенте
Процедура ОтметитьСтрокуТЧ_ОК(СтрПакета)
	ТекГео = ?(ДанныеГеоПозиции = Неопределено, "", ДанныеГеоПозиции.ТекущееМестоположение);
	Если Не СтрПакета.Факт Тогда
		СтрПакета.Факт = ИСТИНА;	
		СтрПакета.ПроверкаПройдена = ИСТИНА;
		СтрПакета.Гео = ТекГео;
	Иначе
		//А пакет уже отмечен
		Если ТекГео <> ТекГео или ТекГео = "" Тогда
			ОбработчикОтветаВводаНовогоДубля = Новый ОписаниеОповещения("ОбработчикОтветаВводаНовогоДубля", ЭтотОбъект, СтрПакета);
			ТекстВопроса = 
			"Пакет уже был отмечен в другой геопозиции
			|Зарегистрировать дубль пакета?";
			ПоказатьВопрос(ОбработчикОтветаВводаНовогоДубля, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
		
	КонецЕсли;
	ОбновитьЗаголовокСтраницыПакеты();
КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьФормуРегистрацииДубля(ПараметрыСтроки, ТаблицаФормы)
	ОбработчикЗакрытияФормыДубля = Новый ОписаниеОповещения("ОбработчикЗакрытияФормыДубля", ЭтотОбъект, ТаблицаФормы);
	ОткрытьФорму("Документ.ИнвентаризацияПакетов.Форма.ФормаРегистрацииДубля", Новый Структура("ПараметрыСтроки", ПараметрыСтроки), ЭтаФорма,,,,ОбработчикЗакрытияФормыДубля);
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОтветаВводаНовогоДубля(Результат, СтрПакета) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		ПараметрыСтроки = Новый Структура("НомерПакета,Гео,Штабель,Ряд,Ярус");
		ЗаполнитьЗначенияСвойств(ПараметрыСтроки, СтрПакета);
		ОткрытьФормуРегистрацииДубля(ПараметрыСтроки, Новый Структура("ИмяТаблицы,СтрокаТаблицы", "Пакеты", СтрПакета));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытияФормыДубля(Результат, ОписаниеТаблицыВызова) Экспорт
	Если Не Результат = Неопределено Тогда 
		Если ОписаниеТаблицыВызова.ИмяТаблицы = "Пакеты" Тогда
			СтрокаДубля = Объект.ДублиПакетов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДубля, Результат);
		ИначеЕсли ОписаниеТаблицыВызова.ИмяТаблицы = "ДублиПакетов" Тогда
			СтрокаДубля = ОписаниеТаблицыВызова.СтрокаТаблицы;
			ЗаполнитьЗначенияСвойств(СтрокаДубля, Результат);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДублиПакетовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	ТекДанные = Элементы.ДублиПакетов.ТекущиеДанные;
	ПараметрыСтроки = Новый Структура("НомерПакета,Гео,Штабель,Ряд,Ярус");
	ЗаполнитьЗначенияСвойств(ПараметрыСтроки, ТекДанные); 
	ОткрытьФормуРегистрацииДубля(ПараметрыСтроки, Новый Структура("ИмяТаблицы,СтрокаТаблицы", "ДублиПакетов", ТекДанные));
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВводНомераПакета(РезультатВыбора, Доп) Экспорт
	Если РезультатВыбора = Неопределено Тогда Возврат КонецЕсли;
	ТипРезультата = ТипЗнч(РезультатВыбора);
	Если ТипРезультата = Тип("Строка") Тогда
		СтрокиПакета = Объект.Пакеты.НайтиСтроки(Новый Структура("НомерПакета",РезультатВыбора));
	ИначеЕсли ТипРезультата = Тип("УникальныйИдентификатор") Тогда
		СтрокиПакета = Объект.Пакеты.НайтиСтроки(Новый Структура("Пакет",РезультатВыбора));	
	Иначе
		Возврат
	КонецЕсли;
	Если СтрокиПакета.Количество() > 0 Тогда 
		ОтметитьСтрокуТЧ_ОК(СтрокиПакета[0]);
	КонецЕсли;
	ОбновитьЗаголовокСтраницыПакеты();
КонецПроцедуры

                                                                 
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьЗаголовокСтраницыПакеты();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастроитьФорму()
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДубльВручную(Команда)
	Нов = Объект.ДублиПакетов.Добавить();
	ПараметрыСтроки = Новый Структура("НомерПакета,Гео,Штабель,Ряд,Ярус");
	//ЗаполнитьЗначенияСвойств(ПараметрыСтроки, ТекДанные); 
	ОткрытьФормуРегистрацииДубля(ПараметрыСтроки, Новый Структура("ИмяТаблицы,СтрокаТаблицы", "ДублиПакетов", Нов));

КонецПроцедуры



#КонецОбласти
