
&НаКлиенте
Процедура Завершить(Команда)
	ДанныеВозврата = Новый Структура("Сорт,Ячейки,ДлинаОт,ДлинаДо", Сорт, СписокЯчеек, ДлинаОт, ДлинаДо);
	ЭтаФорма.Закрыть(ДанныеВозврата);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокЯчеек.ЗагрузитьЗначения(Параметры.СписокЯчеек.ВыгрузитьЗначения());
	Сорт = Параметры.Сорт;
	ДлинаОт = Параметры.ДлинаОт;
	ДлинаДо = Параметры.ДлинаДо;
	Заголовок = Параметры.ОписаниеПартии;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораЯчейки(Результат, ДопПар) Экспорт
	Если Не Результат = Неопределено Тогда
		Если СписокЯчеек.НайтиПоЗначению(Результат) = Неопределено Тогда
			СписокЯчеек.Вставить(0, Результат);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЯчейку(Команда)
	ОповещениеПослеВыбора = Новый ОписаниеОповещения("ОбработкаВыбораЯчейки", ЭтотОбъект, СписокЯчеек);
	ОткрытьФорму("Справочник.Ячейки.ФормаВыбора", Новый Структура("ВыбранныеЗначения",СписокЯчеек), ЭтаФорма,,,,ОповещениеПослеВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	//Вставить содержимое обработчика
КонецПроцедуры
