Процедура ЗаписатьДанныеГеоПозицииВТрек(Знач ДанныеГеоПозиции) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТекущийТрек.Дата КАК Дата,
	|	ТекущийТрек.id КАК id
	|ИЗ
	|	РегистрСведений.ТекущийТрек КАК ТекущийТрек";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		id = Новый УникальныйИдентификатор;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		id = Выборка.id
	КонецЕсли;
	МЗ = РегистрыСведений.ТекущийТрек.СоздатьМенеджерЗаписи();
	МЗ.id = id;
	ЗаполнитьЗначенияСвойств(МЗ,ДанныеГеоПозиции); 
	МЗ.Записать(ИСТИНА);
КонецПроцедуры 


Процедура АрхивацияТекущегоТрека() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТекущийТрек.id КАК id,
	|	МИНИМУМ(ТекущийТрек.Дата) КАК Начало,
	|	МАКСИМУМ(ТекущийТрек.Дата) КАК Окончание
	|ИЗ
	|	РегистрСведений.ТекущийТрек КАК ТекущийТрек
	|
	|СГРУППИРОВАТЬ ПО
	|	ТекущийТрек.id
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущийТрек.id КАК id,
	|	ТекущийТрек.Дата КАК Дата,
	|	ТекущийТрек.ТекущееМестоположение КАК ТекущееМестоположение,
	|	ТекущийТрек.Скорость КАК Скорость
	|ИЗ
	|	РегистрСведений.ТекущийТрек КАК ТекущийТрек"; 
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат.Получить(0).Выбрать();
	Если Выборка.Следующий() Тогда 
		МЗ = РегистрыСведений.Треки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, Выборка);
		МЗ.ДанныеТрека = Новый ХранилищеЗначения(ОбщегоНазначения.ТаблицаЗначенийВМассив(Результат.Получить(1).Выгрузить()), Новый СжатиеДанных(7));
		МЗ.Записать(); 
		//Чистим
		НЗ = РегистрыСведений.ТекущийТрек.СоздатьНаборЗаписей();
		НЗ.Записать(ИСТИНА);
	КонецЕсли;
	
	
КонецПроцедуры
