Асинх Процедура ОбменятьсяИзменениями() Экспорт
	Если НЕ АвторизацияВыполнена Тогда
		Возврат
	КонецЕсли;
	
	//Ожидание = СлужебныйОбновлениеВызовСервера.НачатьОбменИзменениями();
	Результат = СлужебныйОбновлениеВызовСервера.НачатьОбменИзменениями();
	Если Не Результат = Неопределено Тогда
		
		Если ТипЗнч(Результат) = Тип("Структура") и Результат.Свойство("ИзмененияЯчеек") Тогда
			ИзмененныеЯчейки = Новый Соответствие;
			Для Каждого стр из Результат.ИзмененияЯчеек Цикл
				Ячейка = ИзмененныеЯчейки.Получить(стр.Ключ);
				Если Ячейка = Неопределено Тогда
					Ячейка = ЯчейкиСкладаВызовСервера.ПолучитьЯчейкуПоID(стр.Ключ);
					ИзмененныеЯчейки.Вставить(стр.Ключ, Ячейка); 
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого м Из ИзмененныеЯчейки Цикл
				Оповестить("ИзменениеРазмещенияПакета", Новый Структура("Пакет, Ячейка, Ряд, Уровень, Обновить", НЕОПРЕДЕЛЕНО, м.Значение, 0, 0, ИСТИНА))
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ЗапуститьОбновлениеОстатковСклада(Фоново = Истина) Экспорт 
	Если ЕстьСвязь и АвторизацияВыполнена Тогда 
		Если Фоново Тогда
			Ид_ФоновоеЗадание = СлужебныйОбновлениеВызовСервера.ФоновоеОбновлениеОстатковСклада();
			Оповестить("НачалоДлительногоФоновогоЗадания", Новый Структура("Задание, СобытиеОповещения, ПараметрОповещения", Ид_ФоновоеЗадание, "ИзмененыПакетыНаВилах", "ФоновоеОбновлениеОстатковСклада"));
		Иначе
			СлужебныйОбновлениеВызовСервера.ОбновлениеОстатковСклада(); 
			Оповестить("ИзмененыПакетыНаВилах");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Асинх Процедура ОчисткаСтарыхФайлов(ДнейХранения = 30) Экспорт
	КаталогФайлов = ОбщегоНазначенияКлиент.ПолучитьКаталогСохраненияФото();
	ФайлыКаталога = Ждать НайтиФайлыАсинх(КаталогФайлов); 
	ТекДата = ТекущаяДата();
	СрокХраненияСек = ДнейХранения*24*3600;
	Для Каждого путь из ФайлыКаталога Цикл
		Файл = Новый Файл(путь);
		ВремяИзменения = Ждать Файл.ПолучитьВремяИзмененияАсинх();
		Если ТекДата - ВремяИзменения > СрокХраненияСек Тогда
			УдалитьФайлыАсинх(путь);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПослеЗакрытияФормыОчисткиДанных(Результат, ДопПар) Экспорт 
	РезультатОчистки = ПолучитьИзВременногоХранилища(Результат);
	Если РезультатОчистки = ИСТИНА Тогда
		СлужебныйОбновлениеВызовСервера.ОбновитьСлужебныеСправочники(ЛОЖЬ);
		СлужебныйОбновлениеКлиент.ЗапуститьОбновлениеОстатковСклада(ЛОЖЬ);
	КонецЕсли;
	
КонецПроцедуры
